export const courseList: CourseListData = {
	'01': {
		name: 'คณะวิศวกรรมศาสตร์',
		departments: {
			'0100': {
				name: 'วิศวกรรมเครื่องกลและการบิน-อวกาศ',
				curriculums: {
					'411004': {
						name: '411004 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (ME)'
					},
					'451004': {
						name: '451004 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (ME)'
					},
					'501004': {
						name: '501004 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (ME)'
					},
					'511004': {
						name: '511004 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (ME)'
					},
					'55010014': {
						name: '55010014 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (ME)'
					},
					'60010014': {
						name: '60010014 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (ME)'
					},
					'65010014': {
						name: '65010014 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (ME)'
					},
					'451144': {
						name: '451144 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมการบินและอวกาศ (AE)'
					},
					'501144': {
						name: '501144 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมการบินและอวกาศ (AE)'
					},
					'511144': {
						name: '511144 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมการบินและอวกาศ (AE)'
					},
					'55010024': {
						name: '55010024 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมการบินและอวกาศ (AE)'
					},
					'60010024': {
						name: '60010024 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมการบินและอวกาศ (AE)'
					},
					'65010024': {
						name: '65010024 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมการบินและอวกาศ (AE)'
					},
					'61010034': {
						name: '61010034 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมการบินและอวกาศ (หลักสูตรนานาชาติ) (I-AE)'
					},
					'66010034': {
						name: '66010034 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมการบินและอวกาศ (หลักสูตรนานาชาติ) (I-AE)'
					},
					'62010044': {
						name: '62010044 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (หลักสูตรนานาชาติ) (I-ME)'
					},
					'455032': {
						name: '455032 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต (สาขาวิชาวิศวกรรมเครื่องกล) (MME)'
					},
					'525032': {
						name: '525032 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต (สาขาวิชาวิศวกรรมเครื่องกล) (MME)'
					},
					'55010032': {
						name: '55010032 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมเครื่องกล (MME)'
					},
					'60010032': {
						name: '60010032 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมเครื่องกล (MME)'
					},
					'65010212': {
						name: '65010212 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (MME)'
					},
					'55010052': {
						name: '55010052 วิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมเครื่องกล (MAE)'
					},
					'60010052': {
						name: '60010052 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมการบินและอวกาศ (MAE) (MAE)'
					},
					'65010222': {
						name: '65010222 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมการบินและอวกาศ (MAE)'
					},
					'56010072': {
						name: '56010072 วิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมเครื่องกล (หลักสูตรภาษาอังกฤษ) (EMME)'
					},
					'62010232': {
						name: '62010232 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (EMME)'
					},
					'405143': {
						name: '405143 หลักสูตรปรัชญาดุษฏีบัณฑิต วิศวกรรมเครื่องกล (DME)'
					},
					'55010043': {
						name: '55010043 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (DME)'
					},
					'60010043': {
						name: '60010043 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาวิศวกรรมเครื่องกล (DME)'
					},
					'65010513': {
						name: '65010513 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (DME)'
					}
				}
			},
			'0101': {
				name: 'วิศวกรรมไฟฟ้าและคอมพิวเตอร์',
				curriculums: {
					'411014': {
						name: '411014 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (EE.)'
					},
					'461014': {
						name: '461014 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (EE.)'
					},
					'511014': {
						name: '511014 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (EE.)'
					},
					'55010114': {
						name: '55010114 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (EE.)'
					},
					'60010114': {
						name: '60010114 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (EE.)'
					},
					'65011014': {
						name: '65011014 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (EE.)'
					},
					'461154': {
						name: '461154 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์ (Cpr.E)'
					},
					'491154': {
						name: '491154 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์ (Cpr.E)'
					},
					'54010124': {
						name: '54010124 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์ (Cpr.E)'
					},
					'59010124': {
						name: '59010124 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์ (Cpr.E)'
					},
					'64011024': {
						name: '64011024 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์ (Cpr.E)'
					},
					'58010154': {
						name: '58010154 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (หลักสูตรภาษาอังกฤษ) (E-EE)'
					},
					'63011034': {
						name: '63011034 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (หลักสูตรภาษาอังกฤษ) (E-EE)'
					},
					'455042': {
						name: '455042 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (MEE)'
					},
					'475042': {
						name: '475042 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (MEE)'
					},
					'55010132': {
						name: '55010132 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมไฟฟ้า (MEE)'
					},
					'60010132': {
						name: '60010132 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมไฟฟ้า (MEE)'
					},
					'65011212': {
						name: '65011212 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (MEE)'
					},
					'455333': {
						name: '455333 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (DEE)'
					},
					'55010143': {
						name: '55010143 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาวิศวกรรมไฟฟ้า (DEE)'
					},
					'60010143': {
						name: '60010143 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาวิศวกรรมไฟฟ้า (DEE)'
					},
					'65011513': {
						name: '65011513 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (DEE)'
					}
				}
			},
			'0102': {
				name: 'วิศวกรรมการผลิต',
				curriculums: {
					'411024': {
						name: '411024 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมการผลิต (PE)'
					},
					'451024': {
						name: '451024 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมการผลิต (PE)'
					},
					'501024': {
						name: '501024 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมการผลิต (PE)'
					},
					'55010214': {
						name: '55010214 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมการผลิต (PE)'
					},
					'60010214': {
						name: '60010214 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมการผลิต (PE)'
					},
					'65012014': {
						name: '65012014 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมการผลิต (PE)'
					},
					'55010244': {
						name: '55010244 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมหุ่นยนต์และระบบอัตโนมัติ (หลักสูตรสองภาษา) (B-RE)'
					},
					'58010264': {
						name: '58010264 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมหุ่นยนต์และระบบอัตโนมัติ (หลักสูตรภาษาอังกฤษ) (E-RE)'
					},
					'63012034': {
						name: '63012034 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมหุ่นยนต์และระบบอัตโนมัติ (หลักสูตรภาษาอังกฤษ) (E-RE)'
					},
					'455102': {
						name: '455102 วิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมการผลิต (MPE)'
					},
					'535102': {
						name: '535102 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมการผลิต (MPE)'
					},
					'58010222': {
						name: '58010222 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมการผลิต (MPE)'
					},
					'63012212': {
						name: '63012212 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมการผลิต (MPE)'
					},
					'57010253': {
						name: '57010253 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาวิศวกรรมการผลิต (DPE)'
					},
					'62012523': {
						name: '62012523 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาวิศวกรรมการผลิต (DPE)'
					}
				}
			},
			'0103': {
				name: 'วิศวกรรมเคมี',
				curriculums: {
					'411034': {
						name: '411034 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเคมี (Ch.E)'
					},
					'461034': {
						name: '461034 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเคมี (Ch.E)'
					},
					'511034': {
						name: '511034 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเคมี (Ch.E)'
					},
					'55010314': {
						name: '55010314 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเคมี (Ch.E)'
					},
					'56010314': {
						name: '56010314 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเคมี (Ch.E)'
					},
					'61013014': {
						name: '61013014 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเคมี (Ch.E)'
					},
					'66013014': {
						name: '66013014 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเคมี (Ch.E)'
					},
					'58010344': {
						name: '58010344 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเคมี (หลักสูตรนานาชาติ) (I-Ch.E)'
					},
					'445282': {
						name: '445282 วิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมเคมี (MCHE)'
					},
					'525282': {
						name: '525282 วิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมเคมี (MCHE)'
					},
					'55010322': {
						name: '55010322 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมเคมี (MCHE)'
					},
					'60010322': {
						name: '60010322 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมเคมี (MCHE)'
					},
					'65013212': {
						name: '65013212 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมเคมี (MCHE)'
					},
					'55010333': {
						name: '55010333 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาวิศวกรรมเคมี (DCHE)'
					},
					'60010333': {
						name: '60010333 ปรัชญาดุษฎีบัณฑิต (วิศวกรรมเคมี) (DCHE)'
					},
					'65013513': {
						name: '65013513 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาวิศวกรรมเคมี (DCHE)'
					}
				}
			},
			'0105': {
				name: 'วิศวกรรมขนถ่ายวัสดุและโลจิสติกส์',
				curriculums: {
					'411052': {
						name: '411052 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาเทคโนโลยีขนถ่ายวัสดุ (MHT)'
					},
					'471052': {
						name: '471052 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต (ต่อเนื่อง) สาขาวิชาเทคโนโลยีขนถ่ายวัสดุ (MHT)'
					},
					'521052': {
						name: '521052 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีขนถ่ายวัสดุ (ต่อเนื่อง) (MHT)'
					},
					'431114': {
						name: '431114 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิศวกรรมขนถ่ายวัสดุ (MHE)'
					},
					'451114': {
						name: '451114 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิศวกรรมขนถ่ายวัสดุ (MHE)'
					},
					'461114': {
						name: '461114 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมขนถ่ายวัสดุ (MHE)'
					},
					'511113': {
						name: '511113 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมขนถ่ายวัสดุ (MHE)'
					},
					'511114': {
						name: '511114 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมขนถ่ายวัสดุ (MHE)'
					},
					'55010523': {
						name: '55010523 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมขนถ่ายวัสดุ (MHE)'
					},
					'55010524': {
						name: '55010524 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมขนถ่ายวัสดุ (MHE)'
					},
					'60010523': {
						name: '60010523 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมขนถ่ายวัสดุ (MHE)'
					},
					'60010524': {
						name: '60010524 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมขนถ่ายวัสดุ (MHE)'
					},
					'65015024': {
						name: '65015024 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมขนถ่ายวัสดุ (MHE)'
					},
					'531164': {
						name: '531164 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโลจิสติกส์ (LE)'
					},
					'58010534': {
						name: '58010534 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโลจิสติกส์ (LE)'
					},
					'63015034': {
						name: '63015034 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโลจิสติกส์ (LE)'
					},
					'57010542': {
						name: '57010542 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมขนถ่ายวัสดุและโลจิสติกส์ (MHLE)'
					},
					'62015212': {
						name: '62015212 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมขนถ่ายวัสดุและโลจิสติกส์ (MHLE)'
					}
				}
			},
			'0106': {
				name: 'วิศวกรรมวัสดุและเทคโนโลยีการผลิต',
				curriculums: {
					'411062': {
						name: '411062 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต (ต่อเนื่อง) สาขาวิชาเทคโนโลยีการผลิต (PDT)'
					},
					'521062': {
						name: '521062 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีการผลิต (ต่อเนื่อง) (PDT)'
					},
					'55010612': {
						name: '55010612 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีการผลิต (ต่อเนื่อง) (PDT)'
					},
					'431124': {
						name: '431124 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมวัสดุ (MATE)'
					},
					'451124': {
						name: '451124 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมวัสดุ (MATE)'
					},
					'461124': {
						name: '461124 หลักสูตรวิศวกรรมศาสตรบัณฑิต  (วิชาวิศวกรรมวัสดุ) (MATE)'
					},
					'521124': {
						name: '521124 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมวัสดุ (MATE)'
					},
					'55010624': {
						name: '55010624 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมวัสดุ (MATE)'
					},
					'58010624': {
						name: '58010624 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมวัสดุ (MATE)'
					},
					'63016024': {
						name: '63016024 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมวัสดุ (MATE)'
					},
					'58010654': {
						name: '58010654 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมวัสดุเชิงนวัตกรรม (หลักสูตรนานาชาติ) (I-IME)'
					},
					'63016034': {
						name: '63016034 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมวัสดุเชิงนวัตกรรม (หลักสูตรนานาชาติ) (I-IME)'
					},
					'55010632': {
						name: '55010632 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมวัสดุ (MPTE)'
					},
					'60010632': {
						name: '60010632 วิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมวัสดุ (MPTE)'
					},
					'65016212': {
						name: '65016212 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมวัสดุ (MPTE)'
					},
					'55010643': {
						name: '55010643 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาวิศวกรรมวัสดุ (DPTE)'
					},
					'60010643': {
						name: '60010643 ปรัชญาดุษฎีบัณฑิต สาขาวิชาวิศวกรรมวัสดุ (DPTE)'
					},
					'65016513': {
						name: '65016513 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาวิศวกรรมวัสดุ (DPTE)'
					}
				}
			},
			'0107': {
				name: 'วิศวกรรมเครื่องมือวัดและอิเล็กทรอนิกส์',
				curriculums: {
					'411072': {
						name: '411072 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต (ต่อเนื่อง) สาขาวิชาเทคโนโลยีไฟฟ้าอุตสาหกรรม (IET)'
					},
					'521072': {
						name: '521072 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีไฟฟ้าอุตสาหกรรม  (ต่อเนื่อง) (IET)'
					},
					'55010712': {
						name: '55010712 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีไฟฟ้าอุตสาหกรรม  (ต่อเนื่อง) (IET)'
					},
					'431134': {
						name: '431134 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมระบบเครื่องมือวัด (InSE)'
					},
					'461134': {
						name: '461134 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมระบบเครื่องมือวัด (InSE)'
					},
					'521133': {
						name: '521133 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมระบบเครื่องมือวัด (InSE)'
					},
					'521134': {
						name: '521134 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมระบบเครื่องมือวัด (InSE)'
					},
					'55010723': {
						name: '55010723 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมระบบเครื่องมือวัด (InSE)'
					},
					'55010724': {
						name: '55010724 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมระบบเครื่องมือวัด (InSE)'
					},
					'60010723': {
						name: '60010723 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมระบบเครื่องมือวัด (InSE)'
					},
					'60010724': {
						name: '60010724 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมระบบเครื่องมือวัด (InSE)'
					},
					'56010744': {
						name: '56010744 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้าอุตสาหกรรมและพลังงาน (IEE)'
					},
					'61017034': {
						name: '61017034 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้าอุตสาหกรรมและพลังงาน (IEE)'
					},
					'66017034': {
						name: '66017034 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้าอุตสาหกรรมและพลังงาน (IEE)'
					},
					'65017043': {
						name: '65017043 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเครื่องมือวัดและอัตโนมัติ (InAE)'
					},
					'65017044': {
						name: '65017044 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเครื่องมือวัดและอัตโนมัติ (InAE)'
					},
					'54010732': {
						name: '54010732 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมอัตโนมัติ (MAuE)'
					},
					'59010732': {
						name: '59010732 วิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมอัตโนมัติ (MAuE)'
					},
					'64017212': {
						name: '64017212 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมอัตโนมัติ (MAuE)'
					}
				}
			},
			'0108': {
				name: 'วิศวกรรมโยธา',
				curriculums: {
					'411094': {
						name: '411094 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธา (CE)'
					},
					'451094': {
						name: '451094 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธา (CE)'
					},
					'511094': {
						name: '511094 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธา (CE)'
					},
					'55010814': {
						name: '55010814 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธา (CE)'
					},
					'60010814': {
						name: '60010814 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธา (CE)'
					},
					'65018014': {
						name: '65018014 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธา (CE)'
					},
					'445292': {
						name: '445292 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมโยธา (MCE)'
					},
					'54010822': {
						name: '54010822 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมโยธา (MCE)'
					},
					'59010822': {
						name: '59010822 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมโยธา (MCE)'
					},
					'64018212': {
						name: '64018212 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมโยธา (MCE)'
					},
					'57010832': {
						name: '57010832 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาการบริหารงานก่อสร้าง (XMCM)'
					},
					'62018232': {
						name: '62018232 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาการบริหารงานก่อสร้าง (XMCM)'
					},
					'54010843': {
						name: '54010843 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาวิศวกรรมโยธา (DCE)'
					},
					'59010843': {
						name: '59010843 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาวิศวกรรมโยธา (DCE)'
					},
					'64018513': {
						name: '64018513 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาวิศวกรรมโยธา (DCE)'
					}
				}
			},
			'0109': {
				name: 'วิศวกรรมอุตสาหการ',
				curriculums: {
					'465082': {
						name: '465082 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมการจัดการอุตสาหกรรม (MIE)'
					},
					'411104': {
						name: '411104 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมอุตสาหการ (IE.)'
					},
					'451104': {
						name: '451104 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมอุตสาหการ (IE.)'
					},
					'521104': {
						name: '521104 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมอุตสาหการ (IE.)'
					},
					'55010914': {
						name: '55010914 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมอุตสาหการ (IE.)'
					},
					'60010914': {
						name: '60010914 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมอุตสาหการ (IE.)'
					},
					'65019014': {
						name: '65019014 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมอุตสาหการ (IE.)'
					},
					'55010922': {
						name: '55010922 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต (MIE)'
					},
					'60010922': {
						name: '60010922 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมอุตสาหการ (MIE)'
					},
					'65019212': {
						name: '65019212 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมอุตสาหการ (MIE)'
					},
					'54010932': {
						name: '54010932 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมการจัดการอุตสาหกรรม (XMIE)'
					},
					'60010932': {
						name: '60010932 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมการจัดการอุตสาหกรรม (XMIE)'
					},
					'65019222': {
						name: '65019222 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมการจัดการอุตสาหกรรม (XMIE)'
					},
					'465463': {
						name: '465463 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาวิศวกรรมอุตสาหการ (DIE)'
					},
					'55010943': {
						name: '55010943 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาวิศวกรรมอุตสาหการ (DIE)'
					},
					'60010943': {
						name: '60010943 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาวิศวกรรมอุตสาหการ (DIE)'
					},
					'65019513': {
						name: '65019513 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาวิศวกรรมอุตสาหการ (DIE)'
					}
				}
			}
		}
	},
	'02': {
		name: 'คณะครุศาสตร์อุตสาหกรรม',
		departments: {
			'0201': {
				name: 'ครุศาสตร์เครื่องกล',
				curriculums: {
					'422014': {
						name: '422014 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (TM)'
					},
					'462014': {
						name: '462014 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (TM)'
					},
					'522014': {
						name: '522014 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (TM)'
					},
					'532014': {
						name: '532014 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (TM)'
					},
					'55020114': {
						name: '55020114 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (TM)'
					},
					'60020114': {
						name: '60020114 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (TM)'
					},
					'65021014': {
						name: '65021014 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (5 ปี) (TM)'
					},
					'65021015': {
						name: '65021015 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (5 ปี) (TM)'
					},
					'2022': {
						name: '2022 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต (ต่อเนื่อง 2 ปี) สาขาวิชาวิศวกรรมเครื่องกล (TTM)'
					},
					'60020113': {
						name: '60020113 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล (TTM)'
					},
					'462104': {
						name: '462104 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมการผลิต (TP)'
					},
					'522104': {
						name: '522104 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมการผลิต (TP)'
					},
					'532104': {
						name: '532104 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมการผลิต (TP)'
					},
					'462114': {
						name: '462114 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมแมคคาทรอนิกส์ (TT)'
					},
					'522114': {
						name: '522114 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมแมคคาทรอนิกส์ (TT)'
					},
					'55020134': {
						name: '55020134 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมแมคคาทรอนิกส์ (TT)'
					},
					'60020134': {
						name: '60020134 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมแมคคาทรอนิกส์ (TT)'
					},
					'55020164': {
						name: '55020164 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมการผลิตและอุตสาหการ (TP)'
					},
					'60020164': {
						name: '60020164 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมการผลิตและอุตสาหการ (TP)'
					},
					'64021054': {
						name: '64021054 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมการผลิตและอุตสาหการ (4 ปี) (TP)'
					},
					'60020133': {
						name: '60020133 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมแมคคาทรอนิกส์ (TTT)'
					},
					'60020163': {
						name: '60020163 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมการผลิตและอุตสาหการ (TTP)'
					},
					'64021073': {
						name: '64021073 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมการผลิตและอุตสาหการ (4 ปี) (TTP)'
					},
					'65021084': {
						name: '65021084 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมแมคคาทรอนิกส์และหุ่นยนต์ (TT)'
					},
					'455012': {
						name: '455012 ครุศาสตร์อุตสาหกรรมมหาบัณฑิต สาขาครุศาสตร์เครื่องกล (MTM)'
					},
					'55020142': {
						name: '55020142 หลักสูตรครุศาสตร์อุตสาหกรรมมหาบัณฑิต  สาขาวิชาวิศวกรรมเครื่องกล (MTM)'
					},
					'65021272': {
						name: '65021272 หลักสูตรครุศาสตร์อุตสาหกรรมมหาบัณฑิต สาขาวิชาวิศวกรรมเครื่องกลศึกษา (MTM)'
					},
					'55020172': {
						name: '55020172 หลักสูตรครุศาสตร์อุตสาหกรรมมหาบัณฑิต  สาขาวิชาวิศวกรรมแมคคาทรอนิกส์ (MTT)'
					},
					'60020142': {
						name: '60020142 หลักสูตรครุศาสตร์อุตสาหกรรมมหาบัณฑิต  สาขาวิชาวิศวกรรมเครื่องกลศึกษา (MTM)'
					},
					'54020153': {
						name: '54020153 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาวิจัยและพัฒนาการสอนเทคนิคศึกษา (DPRD)'
					},
					'61021533': {
						name: '61021533 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาวิศวกรรมเครื่องกลศึกษา (DMEE)'
					}
				}
			},
			'0202': {
				name: 'ครุศาสตร์ไฟฟ้า',
				curriculums: {
					'432034': {
						name: '432034 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (TE)'
					},
					'522034': {
						name: '522034 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (TE)'
					},
					'55020214': {
						name: '55020214 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (TE)'
					},
					'60020214': {
						name: '60020214 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (TE)'
					},
					'65022014': {
						name: '65022014 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (4 ปี) (TE)'
					},
					'402042': {
						name: '402042 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต  สาขาวิชาวิศวกรรมไฟฟ้า (TTE)'
					},
					'522042': {
						name: '522042 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (TTE)'
					},
					'55020242': {
						name: '55020242 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (TTE)'
					},
					'60020242': {
						name: '60020242 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (TTE)'
					},
					'65022023': {
						name: '65022023 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า (4 ปี) (TTE)'
					},
					'61022035': {
						name: '61022035 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้าและการศึกษา (TEE)'
					},
					'66022035': {
						name: '66022035 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้าและการศึกษา (TEE)'
					},
					'445062': {
						name: '445062 ครุศาสตร์อุตสาหกรรมมหาบัณฑิต สาขาวิชาไฟฟ้า (MTE)'
					},
					'65022272': {
						name: '65022272 ครุศาสตร์อุตสาหกรรมมหาบัณฑิต (วิศวกรรมไฟฟ้า) (MTE)'
					},
					'55020222': {
						name: '55020222 หลักสูตรครุศาสตร์อุตสาหกรรมมหาบัณฑิต  สาขาวิชาวิศวกรรมไฟฟ้า (MTE)'
					},
					'60020222': {
						name: '60020222 หลักสูตรครุศาสตร์อุตสาหกรรมมหาบัณฑิต  สาขาวิชาวิศวกรรมไฟฟ้าศึกษา (MTE)'
					},
					'54020233': {
						name: '54020233 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาวิศวกรรมไฟฟ้าศึกษา (DTE)'
					},
					'64022533': {
						name: '64022533 ปรัชญาดุษฎีบัณฑิต (สาขาวิชาวิศวกรรมไฟฟ้าศึกษา) (DTE)'
					},
					'59020233': {
						name: '59020233 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาวิศวกรรมไฟฟ้าศึกษา (DTE)'
					},
					'57020253': {
						name: '57020253 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาวิศวกรรมไฟฟ้าและพลังงาน (หลักสูตรภาษาอังกฤษ) (EDEEE)'
					},
					'63022543': {
						name: '63022543 ปรัชญาดุษฎีบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้าและพลังงาน (หลักสูตรภาษาอังกฤษ) (EDEEE)'
					}
				}
			},
			'0203': {
				name: 'ครุศาสตร์โยธา',
				curriculums: {
					'402052': {
						name: '402052 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมโยธา (TTC)'
					},
					'522052': {
						name: '522052 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต (ต่อเนื่อง) สาขาวิชาวิศวกรรมโยธา (TTC)'
					},
					'54020312': {
						name: '54020312 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมโยธา (TTC)'
					},
					'54020314': {
						name: '54020314 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมโยธา (TTC)'
					},
					'492122': {
						name: '492122 หลักสูตรวิทยาศาสตรบัณฑิต (ต่อเนื่อง) สาขาวิชาการบริหารงานวิศวกรรมโยธา (CEM)'
					},
					'532135': {
						name: '532135 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธาและการศึกษา (CEE)'
					},
					'56020325': {
						name: '56020325 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธาและการศึกษา (CEE)'
					},
					'58020325': {
						name: '58020325 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธาและการศึกษา (CEE)'
					},
					'61023035': {
						name: '61023035 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธาและการศึกษา (CEE)'
					},
					'63023035': {
						name: '63023035 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธาและการศึกษา (CEE)'
					},
					'465072': {
						name: '465072 หลักสูตรครุศาสตร์อุตสาหกรรมมหาบัณฑิต  สาขาวิชาโยธา (MTC)'
					},
					'525072': {
						name: '525072 โยธา (MTC)'
					},
					'56020352': {
						name: '56020352 วิศวกรรมโยธาและการศึกษา (MCEE)'
					},
					'62023252': {
						name: '62023252 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมโยธาและการศึกษา (MCEE)'
					},
					'55020363': {
						name: '55020363 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาวิศวกรรมโยธาและการศึกษา (DCEE)'
					}
				}
			},
			'0204': {
				name: 'คอมพิวเตอร์ศึกษา',
				curriculums: {
					'412092': {
						name: '412092 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต (ต่อเนื่อง 2 ปี) สาขาวิชาเทคโนโลยีคอมพิวเตอร์ (TCT)'
					},
					'522092': {
						name: '522092 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาเทคโนโลยีคอมพิวเตอร์ (ต่อเนื่อง) (TCT)'
					},
					'54020412': {
						name: '54020412 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาเทคโนโลยีคอมพิวเตอร์ (TCT)'
					},
					'59020413': {
						name: '59020413 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาเทคโนโลยีคอมพิวเตอร์ (TCT)'
					},
					'64024013': {
						name: '64024013 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาเทคโนโลยีคอมพิวเตอร์ (4 ปี) (TCT)'
					},
					'54020414': {
						name: '54020414 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาเทคโนโลยีคอมพิวเตอร์ (CED)'
					},
					'59020415': {
						name: '59020415 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาเทคโนโลยีคอมพิวเตอร์ (CED)'
					},
					'64024024': {
						name: '64024024 หลักสูตรครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาเทคโนโลยีคอมพิวเตอร์ (4 ปี) (CED)'
					},
					'465222': {
						name: '465222 ครุศาสตร์อุตสาหกรรมมหาบัณฑิต  สาขาวิชาเทคโนโลยีคอมพิวเตอร์ (MTCT)'
					},
					'55020422': {
						name: '55020422 หลักสูตรครุศาสตร์อุตสาหกรรมมหาบัณฑิต  สาขาวิชาเทคโนโลยีคอมพิวเตอร์ (MTCT)'
					},
					'60020442': {
						name: '60020442 ครุศาสตร์อุตสาหกรรมมหาบัณฑิต (คอมพิวเตอร์ศึกษา) (MTCT)'
					},
					'65024252': {
						name: '65024252 หลักสูตรครุศาสตร์อุตสาหกรรมมหาบัณฑิต สาขาวิชาคอมพิวเตอร์ศึกษา (MTCT)'
					},
					'455353': {
						name: '455353 หลักสูตรปรัชญาดุษฎีบัณฑิตสาขาวิชาคอมพิวเตอร์ศึกษา (DTCT)'
					},
					'55020433': {
						name: '55020433 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาคอมพิวเตอร์ศึกษา (DTCT)'
					},
					'60020433': {
						name: '60020433 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาคอมพิวเตอร์ศึกษา (DTCT)'
					},
					'65024513': {
						name: '65024513 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาคอมพิวเตอร์ศึกษา (DTCT)'
					}
				}
			},
			'0205': {
				name: 'ครุศาสตร์เทคโนโลยีและสารสนเทศ',
				curriculums: {
					'245052': {
						name: '245052 หลักสูตรครุศาสตร์อุตสาหกรรมมหาบัณฑิต  สาขาเทคโนโลยีเทคนิคศึกษา (MET)'
					},
					'55020512': {
						name: '55020512 หลักสูตรครุศาสตร์อุตสาหกรรมมหาบัณฑิต  สาขาวิชาเทคโนโลยีเทคนิคศึกษา (MET)'
					},
					'60020512': {
						name: '60020512 หลักสูตรครุศาสตร์อุตสาหกรรมมหาบัณฑิต  สาขาวิชาเทคโนโลยีเทคนิคศึกษา (MET)'
					},
					'58029922': {
						name: '58029922 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาเทคโนโลยีสารสนเทศและการสื่อสารเพื่อการศึกษา (MICT)'
					},
					'64025232': {
						name: '64025232 หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาเทคโนโลยีสารสนเทศและการสื่อสารเพื่อการศึกษา (MICT)'
					},
					'59029932': {
						name: '59029932 หลักสูตรครุศาสตร์อุตสาหกรรมมหาบัณฑิต  สาขาวิชาการสอนอาชีวะและเทคนิคศึกษา (MTV)'
					},
					'64025262': {
						name: '64025262 หลักสูตรครุศาสตร์อุตสาหกรรมมหาบัณฑิต  สาขาวิชาเทคโนโลยีดิจิทัลเทคนิคศึกษา (MET)'
					},
					'54020523': {
						name: '54020523 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาเทคโนโลยีเทคนิคศึกษา (DET)'
					},
					'60020523': {
						name: '60020523 ปรัชญาดุษฎีบัณฑิต (เทคโนโลยีเทคนิคศึกษา) (DET)'
					},
					'54020013': {
						name: '54020013 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาเทคโนโลยีสารสนเทศและการสื่อสารเพื่อการศึกษา (DICT)'
					},
					'59029913': {
						name: '59029913 ปรัชญาดุษฎีบัณฑิต เทคโนโลยีสารสนเทศและการสื่อสารเพื่อการศึกษา (DICT)'
					},
					'64025543': {
						name: '64025543 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาเทคโนโลยีสารสนเทศและการสื่อสารเพื่อการศึกษา (DICT)'
					},
					'64025563': {
						name: '64025563 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาเทคโนโลยีดิจิทัลเทคนิคศึกษา (DET)'
					}
				}
			},
			'0206': {
				name: 'บริหารเทคนิคศึกษา',
				curriculums: {
					'345022': {
						name: '345022 ครุศาสตร์อุตสาหกรรมมหาบัณฑิต สาขาวิชาบริหารอาชีวะและเทคนิคศึกษา (TEM)'
					},
					'55020612': {
						name: '55020612 หลักสูตรครุศาสตร์อุตสาหกรรมมหาบัณฑิต  สาขาวิชาบริหารอาชีวะและเทคนิคศึกษา (TEM)'
					},
					'60020612': {
						name: '60020612 หลักสูตรครุศาสตร์อุตสาหกรรมมหาบัณฑิต  สาขาวิชาบริหารอาชีวะและเทคนิคศึกษา (TEM)'
					},
					'64026212': {
						name: '64026212 หลักสูตรครุศาสตร์อุตสาหกรรมมหาบัณฑิต สาขาวิชาบริหารอาชีวะและเทคนิคศึกษา (TEM)'
					},
					'5093': {
						name: '5093 ครุศาสตร์อุตสาหกรรมดุษฎีบัณฑิต สาขาวิจัยและพัฒนาหลักสูตร (DRD)'
					},
					'405153': {
						name: '405153 ครุศาสตร์อุตสาหกรรมดุษฎีบัณฑิต สาขาวิชาบริหารอาชีวะและเทคนิคศึกษา (DTEM)'
					},
					'55020633': {
						name: '55020633 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาบริหารอาชีวะและเทคนิคศึกษา (DVTM)'
					},
					'60020633': {
						name: '60020633 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาบริหารอาชีวะและเทคนิคศึกษา (DVTM)'
					},
					'65026543': {
						name: '65026543 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาบริหารอาชีวะและเทคนิคศึกษา (DVTM)'
					}
				}
			},
			'0207': {
				name: 'บริหารธุรกิจอุตสาหกรรม',
				curriculums: {
					'395122': {
						name: '395122 หลักสูตรครุศาสตร์อุตสาหกรรมมหาบัณฑิต สาขาวิชาธุรกิจอุตสาหกรรม (MIB)'
					}
				}
			},
			'0208': {
				name: '-',
				curriculums: {}
			},
			'0299': {
				name: '-',
				curriculums: {}
			}
		}
	},
	'03': {
		name: 'วิทยาลัยเทคโนโลยีอุตสาหกรรม',
		departments: {
			'0300': {
				name: 'เทคโนโลยีศิลปอุตสาหกรรม',
				curriculums: {
					'3242': {
						name: '3242 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต (ต่อเนื่อง) สาขาวิชาเทคโนโลยีศิลปอุตสาหกรรม (FDT)'
					},
					'483242': {
						name: '483242 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต (ต่อเนื่อง) สาขาวิชาเทคโนโลยีศิลปอุตสาหกรรม (FDT)'
					}
				}
			},
			'0301': {
				name: 'เทคโนโลยีวิศวกรรมเครื่องกล',
				curriculums: {
					'443334': {
						name: '443334 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมเครื่องมือ (TDET)'
					},
					'453384': {
						name: '453384 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมการออกแบบและผลิตเครื่องจักรกล (MDET)'
					},
					'523384': {
						name: '523384 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมการออกแบบและผลิตเครื่องจักรกล (MDET)'
					},
					'55030114': {
						name: '55030114 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมการออกแบบและผลิตเครื่องจักรกล (MDET)'
					},
					'60030113': {
						name: '60030113 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมการออกแบบและผลิตเครื่องจักรกล (MDET)'
					},
					'60030114': {
						name: '60030114 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมการออกแบบและผลิตเครื่องจักรกล (MDET)'
					},
					'65031013': {
						name: '65031013 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมการออกแบบและผลิตเครื่องจักรกล (MDET)'
					},
					'65031014': {
						name: '65031014 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมการออกแบบและผลิตเครื่องจักรกล (MDET)'
					},
					'3212': {
						name: '3212 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องกล (ออกแบบเครื่องกล) (MDT)'
					},
					'483212': {
						name: '483212 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต (ต่อเนื่อง) สาขาวิชาเทคโนโลยีเครื่องกล (ออกแบบเครื่องกล) (MDT)'
					},
					'523212': {
						name: '523212 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องกล  (ต่อเนื่อง) (MDT)'
					},
					'55030122': {
						name: '55030122 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องกล  (ต่อเนื่อง) (MDT)'
					},
					'60030122': {
						name: '60030122 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องกล (ต่อเนื่อง) (MDT)'
					},
					'64031022': {
						name: '64031022 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องกล (ต่อเนื่อง) (MDT)'
					},
					'3222': {
						name: '3222 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต (ต่อเนื่อง 2 ปี) สาขาเทคโนโลยีเครื่องกล (ออกแบบแม่พิมพ์) (TDT)'
					},
					'483222': {
						name: '483222 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต (ต่อเนื่อง) สาขาเทคโนโลยีเครื่องกล (TDT)'
					},
					'523222': {
						name: '523222 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาเทคโนโลยีเครื่องกล (ต่อเนื่อง) (TDT)'
					},
					'55030162': {
						name: '55030162 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องกล (ต่อเนื่อง) (TDT)'
					},
					'60030162': {
						name: '60030162 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องกล (ต่อเนื่อง) (TDT)'
					},
					'64031032': {
						name: '64031032 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องกล (ต่อเนื่อง) (TDT)'
					},
					'523663': {
						name: '523663 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมแม่พิมพ์และเครื่องมือ (TDET)'
					},
					'523664': {
						name: '523664 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมแม่พิมพ์และเครื่องมือ (TDET)'
					},
					'55030133': {
						name: '55030133 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมแม่พิมพ์และเครื่องมือ (TDET)'
					},
					'55030134': {
						name: '55030134 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมแม่พิมพ์และเครื่องมือ (TDET)'
					},
					'60030133': {
						name: '60030133 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมแม่พิมพ์และเครื่องมือ (TDET)'
					},
					'60030134': {
						name: '60030134 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมแม่พิมพ์และเครื่องมือ (TDET)'
					},
					'65031043': {
						name: '65031043 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมแม่พิมพ์และเครื่องมือ (TDET)'
					},
					'65031044': {
						name: '65031044 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมแม่พิมพ์และเครื่องมือ (TDET)'
					},
					'473484': {
						name: '473484 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมแมคคาทรอนิกส์ (MtET)'
					},
					'523484': {
						name: '523484 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมแมคคาทรอนิกส์ (MtET)'
					},
					'55030144': {
						name: '55030144 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมแมคคาทรอนิกส์ (MtET)'
					},
					'60030144': {
						name: '60030144 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมแมคคาทรอนิกส์ (MtET)'
					},
					'65031054': {
						name: '65031054 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมแมคคาทรอนิกส์ (MtET)'
					},
					'473474': {
						name: '473474 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมพอลิเมอร์ (PoET)'
					},
					'523474': {
						name: '523474 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมพอลิเมอร์ (PoET)'
					},
					'55030154': {
						name: '55030154 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมพอลิเมอร์ (PoET)'
					},
					'60030154': {
						name: '60030154 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมพอลิเมอร์ (PoET)'
					},
					'55030172': {
						name: '55030172 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีแมคคาทรอนิกส์ (ต่อเนื่อง) (MtT)'
					},
					'60030172': {
						name: '60030172 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีแมคคาทรอนิกส์ (ต่อเนื่อง) (MtT)'
					},
					'64031072': {
						name: '64031072 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีแมคคาทรอนิกส์ (ต่อเนื่อง) (MtT)'
					},
					'64031092': {
						name: '64031092 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องกล (ต่อเนื่อง) (AcT)'
					},
					'65031104': {
						name: '65031104 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมพอลิเมอร์และอุตสาหกรรมยาง (PoET)'
					},
					'56030182': {
						name: '56030182 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาเทคโนโลยีวิศวกรรมเครื่องกล (MMET)'
					},
					'61031212': {
						name: '61031212 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมเครื่องกล (MMET)'
					}
				}
			},
			'0302': {
				name: 'เทคโนโลยีวิศวกรรมเครื่องต้นกำลัง',
				curriculums: {
					'453394': {
						name: '453394 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมยานยนต์ (AmET)'
					},
					'523394': {
						name: '523394 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมยานยนต์ (AmET)'
					},
					'55030214': {
						name: '55030214 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมยานยนต์ (AmET)'
					},
					'60030213': {
						name: '60030213 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมยานยนต์ (AmET)'
					},
					'60030214': {
						name: '60030214 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมยานยนต์ (AmET)'
					},
					'65032013': {
						name: '65032013 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมยานยนต์ (AmET)'
					},
					'65032014': {
						name: '65032014 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมยานยนต์ (AmET)'
					},
					'453404': {
						name: '453404 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมการทำความเย็นและปรับอากาศ (RAET)'
					},
					'483404': {
						name: '483404 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมการทำความเย็นและการปรับอากาศ (RAET)'
					},
					'523404': {
						name: '523404 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมการทำความเย็นและการปรับอากาศ (RAET)'
					},
					'55030224': {
						name: '55030224 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมการทำความเย็นและการปรับอากาศ (RAET)'
					},
					'60030223': {
						name: '60030223 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมการทำความเย็นและการปรับอากาศ (RAET)'
					},
					'60030224': {
						name: '60030224 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมการทำความเย็นและการปรับอากาศ (RAET)'
					},
					'65032023': {
						name: '65032023 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมการทำความเย็นและการปรับอากาศ (RAET)'
					},
					'65032024': {
						name: '65032024 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมการทำความเย็นและการปรับอากาศ (RAET)'
					},
					'423272': {
						name: '423272 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต (ต่อเนื่อง 2 ปี) สาขาวิชาเทคโนโลยีเครื่องต้นกำลัง (เทคโนโลยียานยนต์) (AMT)'
					},
					'523272': {
						name: '523272 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องต้นกำลัง (ต่อเนื่อง) (AMT)'
					},
					'55030232': {
						name: '55030232 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องต้นกำลัง (ต่อเนื่อง) (AMT)'
					},
					'60030232': {
						name: '60030232 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องต้นกำลัง (ต่อเนื่อง) (AMT)'
					},
					'65032032': {
						name: '65032032 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องต้นกำลัง (ต่อเนื่อง) (AMT)'
					},
					'413282': {
						name: '413282 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต (ต่อเนื่อง 2 ปี) สาขาวิชาเทคโนโลยีเครื่องต้นกำลัง (IPT)'
					},
					'523282': {
						name: '523282 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องต้นกำลัง (ต่อเนื่อง) (IPT)'
					},
					'55030242': {
						name: '55030242 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องต้นกำลัง (ต่อเนื่อง) (IPT)'
					},
					'60030242': {
						name: '60030242 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องต้นกำลัง (ต่อเนื่อง) (IPT)'
					},
					'57030274': {
						name: '57030274 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมซ่อมบำรุงอากาศยาน (ACET)'
					},
					'62032054': {
						name: '62032054 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมซ่อมบำรุงอากาศยาน (ACET)'
					},
					'65032062': {
						name: '65032062 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องต้นกำลัง (ต่อเนื่อง) (EgT)'
					},
					'55030252': {
						name: '55030252 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาเทคโนโลยีวิศวกรรมยานยนต์และพลังงาน (MAET)'
					},
					'59030252': {
						name: '59030252 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาเทคโนโลยีวิศวกรรมยานยนต์และพลังงาน (MAET)'
					},
					'64032212': {
						name: '64032212 วิศวกรรมศาสตรมหาบัณฑิต (เทคโนโลยีวิศวกรรมยานยนต์และพลังงาน) (MAET)'
					},
					'56030262': {
						name: '56030262 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาเทคโนโลยีวิศวกรรมพลังงาน (MEET)'
					},
					'58030262': {
						name: '58030262 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาเทคโนโลยีวิศวกรรมพลังงาน (MEET)'
					},
					'63032222': {
						name: '63032222 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมพลังงานชื่อหลักสูตรภาษาไทย (MEET)'
					},
					'61032513': {
						name: '61032513 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมพลังงาน (DEET)'
					},
					'66032513': {
						name: '66032513 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมพลังงาน (DEET)'
					},
					'61032533': {
						name: '61032533 หลักสูตรวิศวกรรมศาสตรดุษฎีบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมยานยนต์และพลังงาน (DAET)'
					}
				}
			},
			'0303': {
				name: 'เทคโนโลยีวิศวกรรมการเชื่อม',
				curriculums: {
					'443344': {
						name: '443344 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมการเชื่อม (WdET)'
					},
					'523344': {
						name: '523344 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมการเชื่อม (WdET)'
					},
					'55030314': {
						name: '55030314 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมการเชื่อม (WdET)'
					},
					'60030314': {
						name: '60030314 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมการเชื่อม (WdET)'
					},
					'65033014': {
						name: '65033014 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมการเชื่อม (WdET)'
					},
					'3262': {
						name: '3262 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต (ต่อเนื่อง 2 ปี) สาขาวิชาเทคโนโลยีการเชื่อม (WDT)'
					},
					'523262': {
						name: '523262 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีการเชื่อม (ต่อเนื่อง) (WDT)'
					},
					'55030322': {
						name: '55030322 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีการเชื่อม (ต่อเนื่อง) (WDT)'
					},
					'60030322': {
						name: '60030322 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีการเชื่อม (ต่อเนื่อง) (WDT)'
					},
					'64033022': {
						name: '64033022 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีการเชื่อม (ต่อเนื่อง) (WDT)'
					},
					'57030332': {
						name: '57030332 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาเทคโนโลยีวิศวกรรมการเชื่อม (SMWET)'
					},
					'62033212': {
						name: '62033212 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมการเชื่อม (SMWET)'
					}
				}
			},
			'0304': {
				name: 'เทคโนโลยีวิศวกรรมไฟฟ้า',
				curriculums: {
					'443354': {
						name: '443354 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมอิเล็กทรอนิกส์กำลัง (PnET)'
					},
					'523354': {
						name: '523354 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมอิเล็กทรอนิกส์กำลัง (PnET)'
					},
					'55030413': {
						name: '55030413 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมอิเล็กทรอนิกส์กำลัง (PnET)'
					},
					'55030414': {
						name: '55030414 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมอิเล็กทรอนิกส์กำลัง (PnET)'
					},
					'3292': {
						name: '3292 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต (ต่อเนื่อง) สาขาวิชาเทคโนโลยีอิเล็กทรอนิกส์กำลัง (PNT)'
					},
					'523292': {
						name: '523292 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีอิเล็กทรอนิกส์กำลัง (ต่อเนื่อง) (PNT)'
					},
					'55030422': {
						name: '55030422 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีอิเล็กทรอนิกส์กำลัง (ต่อเนื่อง) (PNT)'
					},
					'60030413': {
						name: '60030413 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมไฟฟ้าและอิเล็กทรอนิกส์กำลัง (PnET)'
					},
					'60030414': {
						name: '60030414 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมไฟฟ้าและอิเล็กทรอนิกส์กำลัง (PnET)'
					},
					'64034033': {
						name: '64034033 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมไฟฟ้าและอิเล็กทรอนิกส์กำลัง (PnET)'
					},
					'64034034': {
						name: '64034034 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมไฟฟ้าและอิเล็กทรอนิกส์กำลัง (PnET)'
					},
					'60030422': {
						name: '60030422 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีไฟฟ้าและอิเล็กทรอนิกส์กำลัง (ต่อเนื่อง) (PNT)'
					},
					'64034042': {
						name: '64034042 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีไฟฟ้าและอิเล็กทรอนิกส์กำลัง (ต่อเนื่อง) (PNT)'
					},
					'59030432': {
						name: '59030432 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาเทคโนโลยีวิศวกรรมไฟฟ้าประยุกต์ (MAEE)'
					},
					'64034212': {
						name: '64034212 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมไฟฟ้าประยุกต์ (MAEE)'
					}
				}
			},
			'0305': {
				name: 'เทคโนโลยีวิศวกรรมอิเล็กทรอนิกส์',
				curriculums: {
					'453414': {
						name: '453414 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมอิเล็กทรอนิกส์ (EnET)'
					},
					'523414': {
						name: '523414 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมอิเล็กทรอนิกส์ (EnET)'
					},
					'55030513': {
						name: '55030513 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมอิเล็กทรอนิกส์ (EnET)'
					},
					'55030514': {
						name: '55030514 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมอิเล็กทรอนิกส์ (EnET)'
					},
					'60030514': {
						name: '60030514 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมอิเล็กทรอนิกส์ (EnET)'
					},
					'65035013': {
						name: '65035013 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมอิเล็กทรอนิกส์ (EnET)'
					},
					'65035014': {
						name: '65035014 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมอิเล็กทรอนิกส์ (EnET)'
					},
					'3312': {
						name: '3312 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต (ต่อเนื่อง) สาขาวิชาเทคโนโลยีอิเล็กทรอนิกส์(เครื่องมือวัดและควบคุม) (EIT)'
					},
					'523312': {
						name: '523312 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีอิเล็กทรอนิกส์ (ต่อเนื่อง) (EIT)'
					},
					'55030522': {
						name: '55030522 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีอิเล็กทรอนิกส์ (ต่อเนื่อง) (EIT)'
					},
					'60030522': {
						name: '60030522 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีอิเล็กทรอนิกส์ (ต่อเนื่อง) (EIT)'
					},
					'65035022': {
						name: '65035022 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีอิเล็กทรอนิกส์ (ต่อเนื่อง) (EIT)'
					},
					'3302': {
						name: '3302 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต (ต่อเนื่อง) สาขาวิชาเทคโนโลยีอิเล็กทรอนิกส์ (คอมพิวเตอร์) (ECT)'
					},
					'523302': {
						name: '523302 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีอิเล็กทรอนิกส์ (ต่อเนื่อง) (ECT)'
					},
					'55030532': {
						name: '55030532 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีอิเล็กทรอนิกส์ (ต่อเนื่อง) (ECT)'
					},
					'60030532': {
						name: '60030532 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีอิเล็กทรอนิกส์ (ต่อเนื่อง) (ECT)'
					},
					'65035032': {
						name: '65035032 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีอิเล็กทรอนิกส์ (ต่อเนื่อง) (ECT)'
					},
					'3322': {
						name: '3322 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต (ต่อเนื่อง) สาขาวิชาเทคโนโลยีอิเล็กทรอนิกส์(โทรคมนาคม) (ETT)'
					},
					'523322': {
						name: '523322 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีอิเล็กทรอนิกส์ (ต่อเนื่อง) (ETT)'
					},
					'55030542': {
						name: '55030542 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีอิเล็กทรอนิกส์ (ต่อเนื่อง) (ETT)'
					},
					'60030542': {
						name: '60030542 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีอิเล็กทรอนิกส์ (ต่อเนื่อง) (ETT)'
					},
					'65035042': {
						name: '65035042 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีอิเล็กทรอนิกส์ (ต่อเนื่อง) (ETT)'
					},
					'56030552': {
						name: '56030552 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาเทคโนโลยีวิศวกรรมอิเล็กทรอนิกส์ประยุกต์ (MEEE)'
					},
					'64035212': {
						name: '64035212 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมอิเล็กทรอนิกส์ประยุกต์ (MEEE)'
					}
				}
			},
			'0306': {
				name: 'เทคโนโลยีวิศวกรรมโยธาและสิ่งแวดล้อม',
				curriculums: {
					'453424': {
						name: '453424 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมโยธา (CvET)'
					},
					'463424': {
						name: '463424 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมโยธา (CvET)'
					},
					'503424': {
						name: '503424 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธาและเทคโนโลยี (CvET)'
					},
					'513424': {
						name: '513424 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธาและเทคโนโลยี (CvET)'
					},
					'55030614': {
						name: '55030614 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธาและเทคโนโลยี (CvET)'
					},
					'60030614': {
						name: '60030614 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธาและเทคโนโลยี (CvET)'
					},
					'65036014': {
						name: '65036014 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธาและเทคโนโลยี (CvET)'
					},
					'55030622': {
						name: '55030622 วิศวกรรมศาสตรมหาบัณฑิต (เทคโนโลยีวิศวกรรมการก่อสร้าง) (MCET)'
					},
					'60030622': {
						name: '60030622 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาเทคโนโลยีวิศวกรรมการก่อสร้าง (MCET)'
					},
					'65036222': {
						name: '65036222 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาเทคโนโลยีวิศวกรรมการก่อสร้าง (MCET)'
					},
					'57030632': {
						name: '57030632 วิทยาศาสตรมหาบัณฑิต (การจัดการด้านวิศวกรรมและสิ่งแวดล้อมในเมือง) (MUEM)'
					},
					'65036513': {
						name: '65036513 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาเทคโนโลยีวิศวกรรมการก่อสร้าง (DCET)'
					},
					'413252': {
						name: '413252 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต  (ต่อเนื่อง 2 ปี) สาขาวิชาเทคโนโลยีโยธา (CCT)'
					}
				}
			},
			'0307': {
				name: 'เทคโนโลยีวิศวกรรมอุตสาหการ',
				curriculums: {
					'443364': {
						name: '443364 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมไม้ (WoET)'
					},
					'463364': {
						name: '463364 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมไม้ (WoET)'
					},
					'523364': {
						name: '523364 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมไม้ (WoET)'
					},
					'55030734': {
						name: '55030734 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมอุตสาหการ (InET)'
					},
					'60030734': {
						name: '60030734 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมอุตสาหการ (InET)'
					},
					'64037024': {
						name: '64037024 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมอุตสาหการ (InET)'
					},
					'539562': {
						name: '539562 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาการจัดการเทคโนโลยีวิศวกรรม (METM)'
					},
					'58030722': {
						name: '58030722 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต  สาขาวิชาการจัดการเทคโนโลยีวิศวกรรม (METM)'
					},
					'63037212': {
						name: '63037212 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาการจัดการเทคโนโลยีวิศวกรรม (METM)'
					}
				}
			},
			'0308': {
				name: 'การจัดการเทคโนโลยีฯ',
				curriculums: {
					'473494': {
						name: '473494 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการจัดการเทคโนโลยีการผลิตและสารสนเทศ (IPTM)'
					},
					'523494': {
						name: '523494 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการจัดการเทคโนโลยีการผลิตและสารสนเทศ (IPTM)'
					},
					'55030814': {
						name: '55030814 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการจัดการเทคโนโลยีการผลิตและสารสนเทศ (IPTM)'
					},
					'60030814': {
						name: '60030814 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการจัดการเทคโนโลยีการผลิตและสารสนเทศ (IPTM)'
					},
					'65038014': {
						name: '65038014 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการจัดการเทคโนโลยีการผลิตและสารสนเทศ (IPTM)'
					},
					'64038212': {
						name: '64038212 หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาการจัดการเทคโนโลยีอุตสาหกรรมและสารสนเทศ (MIITM)'
					}
				}
			},
			'0309': {
				name: 'วิทยาศาสตร์ประยุกต์และสังคม',
				curriculums: {
					'56030912': {
						name: '56030912 หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาการจัดการนวัตกรรมเพื่อธุรกิจและอุตสาหกรรม (MIMB)'
					},
					'61039212': {
						name: '61039212 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาการจัดการนวัตกรรมเพื่อธุรกิจและอุตสาหกรรม (หลักสูตรสหวิทยาการ) (MIMB)'
					}
				}
			},
			'0310': {
				name: 'โรงเรียนเตรียมวิศวกรรมศาสตร์ฯ',
				curriculums: {
					'433023': {
						name: '433023 หลักสูตรประกาศนียบัตรวิชาชีพ สาขาเครื่องกล (M)'
					},
					'513023': {
						name: '513023 หลักสูตรประกาศนียบัตรวิชาชีพ สาขาเครื่องกล (M)'
					},
					'64030073': {
						name: '64030073 ประกาศนียบัตรวิชาชีพ (เตรียมวิศวกรรมเครื่องกล) (M)'
					},
					'433103': {
						name: '433103 หลักสูตรประกาศนียบัตรวิชาชีพ สาขาไฟฟ้าและอิเล็กทรอนิกส์ (E)'
					},
					'513103': {
						name: '513103 หลักสูตรประกาศนียบัตรวิชาชีพ สาขาไฟฟ้าและอิเล็กทรอนิกส์ (E)'
					},
					'64030093': {
						name: '64030093 ประกาศนียบัตรวิชาชีพ (เตรียมวิศวกรรมไฟฟ้าและอิเล็กทรอนิกส์) (E)'
					},
					'433173': {
						name: '433173 หลักสูตรประกาศนียบัตรวิชาชีพ สาขาโยธา (C)'
					},
					'513173': {
						name: '513173 หลักสูตรประกาศนียบัตรวิชาชีพ สาขาโยธา (C)'
					},
					'64030113': {
						name: '64030113 ประกาศนียบัตรวิชาชีพ (เตรียมวิศวกรรโยธา) (C)'
					}
				}
			}
		}
	},
	'04': {
		name: 'คณะวิทยาศาสตร์ประยุกต์',
		departments: {
			'0400': {
				name: 'นวัตกรรมและเทคโนโลยีความมั่นคง',
				curriculums: {
					'65040014': {
						name: '65040014 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและเทคโนโลยีความมั่นคง (SIT)'
					}
				}
			},
			'0401': {
				name: 'เคมีอุตสาหกรรม',
				curriculums: {
					'414014': {
						name: '414014 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาเคมีอุตสาหกรรม (IC)'
					},
					'514014': {
						name: '514014 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาเคมีอุตสาหกรรม (IC)'
					},
					'55040114': {
						name: '55040114 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาเคมีอุตสาหกรรม (IC)'
					},
					'60040114': {
						name: '60040114 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาเคมีอุตสาหกรรม (IC)'
					},
					'65041014': {
						name: '65041014 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาเคมีอุตสาหกรรม (IC)'
					},
					'455112': {
						name: '455112 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาเคมีอุตสาหกรรม (MIC)'
					},
					'54040122': {
						name: '54040122 วิทยาศาสตรมหาบัณฑิต (เคมีอุตสาหกรรม) (MIC)'
					},
					'59040122': {
						name: '59040122 หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาเคมีอุตสาหกรรม (MIC)'
					},
					'63041212': {
						name: '63041212 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาเคมีอุตสาหกรรม (MIC)'
					},
					'445272': {
						name: '445272 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาวัสดุศาสตร์ (MMS)'
					},
					'55040143': {
						name: '55040143 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาเคมีอุตสาหกรรม (DIC)'
					},
					'60040143': {
						name: '60040143 ปรัชญาดุษฎีบัณฑิต  สาขาวิชาเคมีอุตสาหกรรม (DIC)'
					}
				}
			},
			'0402': {
				name: 'คณิตศาสตร์',
				curriculums: {
					'414064': {
						name: '414064 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาคณิตศาสตร์ประยุกต์ (MA)'
					},
					'514064': {
						name: '514064 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาคณิตศาสตร์ประยุกต์ (MA)'
					},
					'55040214': {
						name: '55040214 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาคณิตศาสตร์ประยุกต์ (MA)'
					},
					'60040214': {
						name: '60040214 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาคณิตศาสตร์ประยุกต์ (MA)'
					},
					'65042014': {
						name: '65042014 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาคณิตศาสตร์ประยุกต์ (MA)'
					},
					'534154': {
						name: '534154 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาคณิตศาสตร์เชิงวิทยาการคอมพิวเตอร์ (MC)'
					},
					'58040224': {
						name: '58040224 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาคณิตศาสตร์เชิงวิทยาการคอมพิวเตอร์ (MC)'
					},
					'63042024': {
						name: '63042024 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาคณิตศาสตร์เชิงวิทยาการคอมพิวเตอร์ (MC)'
					},
					'435232': {
						name: '435232 วิทยาศาสตรมหาบัณฑิต สาขาคณิตศาสตร์ประยุกต์ (MMA)'
					},
					'55040232': {
						name: '55040232 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาคณิตศาสตร์ประยุกต์ (MMA)'
					},
					'60040232': {
						name: '60040232 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาคณิตศาสตร์ประยุกต์ (MMA)'
					},
					'65042212': {
						name: '65042212 วิทยาศาสตรมหาบัณฑิต (คณิตศาสตร์ประยุกต์) (MMA)'
					},
					'57040252': {
						name: '57040252 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาคณิตศาสตร์เชิงวิทยาการคอมพิวเตอร์ (MMC)'
					},
					'62042242': {
						name: '62042242 หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาคณิตศาสตร์เชิงวิทยาการคอมพิวเตอร์ (MMC)'
					},
					'55040243': {
						name: '55040243 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาคณิตศาสตร์ประยุกต์ (หลักสูตรภาษาอังกฤษ) (EDMA)'
					},
					'60040243': {
						name: '60040243 ปรัชญาดุษฎีบัณฑิต (คณิตศาสตร์ประยุกต์) (EDMA)'
					},
					'65042513': {
						name: '65042513 ปรัชญาดุษฎีบัณฑิต สาขาวิชาคณิตศาสตร์ประยุกต์ (หลักสูตรภาษาอังกฤษ) (EDMA)'
					}
				}
			},
			'0403': {
				name: 'ฟิสิกส์อุตสาหกรรมและอุปกรณ์การแพทย์',
				curriculums: {
					'414034': {
						name: '414034 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาฟิสิกส์อุตสาหกรรมและอุปกรณ์การแพทย์ (IMI)'
					},
					'534034': {
						name: '534034 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาฟิสิกส์อุตสาหกรรมและอุปกรณ์การแพทย์ (IMI)'
					},
					'58040314': {
						name: '58040314 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาฟิสิกส์อุตสาหกรรมและอุปกรณ์การแพทย์ (IMI)'
					},
					'63043014': {
						name: '63043014 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาฟิสิกส์อุตสาหกรรมและอุปกรณ์การแพทย์ (IMI)'
					},
					'474143': {
						name: '474143 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาอุปกรณ์การแพทย์  (ต่อเนื่อง) (IMIs)'
					},
					'534143': {
						name: '534143 หลักสูตรวิทยาศาสตรบัณฑิต (ต่อเนื่อง) สาขาวิชาอุปกรณ์การแพทย์ (IMIs)'
					},
					'54040313': {
						name: '54040313 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาฟิสิกส์อุตสาหกรรมและอุปกรณ์การแพทย์ (IMIs)'
					},
					'58040313': {
						name: '58040313 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาฟิสิกส์อุตสาหกรรมและอุปกรณ์การแพทย์ (IMIs)'
					},
					'63043033': {
						name: '63043033 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาฟิสิกส์อุตสาหกรรมและอุปกรณ์การแพทย์ (IMIs)'
					},
					'56040364': {
						name: '56040364 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาฟิสิกส์วิศวกรรม (หลักสูตรสองภาษา) (B-EPH)'
					},
					'61043044': {
						name: '61043044 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาฟิสิกส์วิศวกรรม (หลักสูตรสองภาษา) (B-EPH)'
					},
					'57040374': {
						name: '57040374 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมชีวการแพทย์ (BME)'
					},
					'62043054': {
						name: '62043054 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมชีวการแพทย์ (BME)'
					},
					'61043064': {
						name: '61043064 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไมโครอิเล็กทรอนิกส์ (MIEE)'
					},
					'66043064': {
						name: '66043064 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไมโครอิเล็กทรอนิกส์ (MIEE)'
					},
					'66043074': {
						name: '66043074 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาฟิสิกส์วิศวกรรม (EPH)'
					},
					'405192': {
						name: '405192 วิทยาศาสตร์มหาบัณฑิต  สาขาวิชาอุปกรณ์การแพทย์ (MMI)'
					},
					'55040332': {
						name: '55040332 หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาอุปกรณ์การแพทย์ (MMI)'
					},
					'58040332': {
						name: '58040332 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาอุปกรณ์การแพทย์ (MMI)'
					},
					'63043212': {
						name: '63043212 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาอุปกรณ์การแพทย์ (MMI)'
					},
					'56040352': {
						name: '56040352 หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาฟิสิกส์ประยุกต์ (MAP)'
					},
					'60040352': {
						name: '60040352 หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาฟิสิกส์ประยุกต์ (MAP)'
					},
					'65043222': {
						name: '65043222 หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาฟิสิกส์ประยุกต์ (MAP)'
					},
					'59040383': {
						name: '59040383 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาฟิสิกส์ประยุกต์ (DAP)'
					},
					'64043513': {
						name: '64043513 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาฟิสิกส์ประยุกต์ (DAP)'
					}
				}
			},
			'0404': {
				name: 'เทคโนโลยีอุตสาหกรรมเกษตร อาหาร และสิ่งแวดล้อม',
				curriculums: {
					'414044': {
						name: '414044 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีอุตสาหกรรมเกษตร (AT)'
					},
					'474044': {
						name: '474044 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีอุตสาหกรรมเกษตร (AT)'
					},
					'534044': {
						name: '534044 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาเทคโนโลยีอุตสาหกรรมเกษตร (AT)'
					},
					'55040414': {
						name: '55040414 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาเทคโนโลยีอุตสาหกรรมเกษตร (AT)'
					},
					'60040414': {
						name: '60040414 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาเทคโนโลยีอุตสาหกรรมเกษตร (AT)'
					},
					'65044014': {
						name: '65044014 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาเทคโนโลยีอุตสาหกรรมเกษตร (AT)'
					},
					'474124': {
						name: '474124 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีสิ่งแวดล้อม (ET)'
					},
					'534124': {
						name: '534124 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีสิ่งแวดล้อม (ET)'
					},
					'58040424': {
						name: '58040424 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีสิ่งแวดล้อม (ET)'
					},
					'62044054': {
						name: '62044054 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์และเทคโนโลยีสิ่งแวดล้อม (ET)'
					},
					'474134': {
						name: '474134 วิทยาศาสตรบัณฑิต  สาขาวิชาวิทยาศาสตร์และเทคโนโลยีทางอาหาร (FT)'
					},
					'534134': {
						name: '534134 วิทยาศาสตรบัณฑิต  สาขาวิชาวิทยาศาสตร์และเทคโนโลยีทางอาหาร (FT)'
					},
					'58040434': {
						name: '58040434 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาวิทยาศาสตร์และเทคโนโลยีทางอาหาร (FT)'
					},
					'63044034': {
						name: '63044034 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาวิทยาศาสตร์และเทคโนโลยีทางอาหาร (FT)'
					},
					'62044044': {
						name: '62044044 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีอุตสาหกรรมเกษตรและนวัตกรรม (ATI)'
					},
					'58040442': {
						name: '58040442 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาเทคโนโลยีอุตสาหกรรมชีวภาพ (MBIT)'
					},
					'63044212': {
						name: '63044212 หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาเทคโนโลยีอุตสาหกรรมชีวภาพ (MBIT)'
					},
					'55040452': {
						name: '55040452 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาเทคโนโลยีสิ่งแวดล้อม (MENV)'
					},
					'60040472': {
						name: '60040472 หลักสูตรวิทยาศาสตรมหาบัณฑิตสาขาวิชาเทคโนโลยีและการจัดการสิ่งแวดล้อม (MENVTM)'
					},
					'65044232': {
						name: '65044232 หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาเทคโนโลยีและการจัดการสิ่งแวดล้อม (MENVTM)'
					},
					'64044242': {
						name: '64044242 หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาวิทยาศาสตร์และเทคโนโลยีทางอาหาร (MFT)'
					},
					'54040463': {
						name: '54040463 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาเทคโนโลยีอุตสาหกรรมชีวภาพ (DBIT)'
					},
					'60040463': {
						name: '60040463 ปรัชญาดุษฎีบัณฑิต (เทคโนโลยีอุตสาหกรรมชีวภาพ) (DBIT)'
					},
					'65044513': {
						name: '65044513 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาเทคโนโลยีอุตสาหกรรมชีวภาพ (DBIT)'
					},
					'62044523': {
						name: '62044523 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาเทคโนโลยีและการจัดการสิ่งแวดล้อม (DENVTM)'
					}
				}
			},
			'0405': {
				name: 'สถิติประยุกต์',
				curriculums: {
					'424024': {
						name: '424024 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาสถิติประยุกต์ (AS)'
					},
					'534024': {
						name: '534024 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาสถิติประยุกต์ (AS)'
					},
					'58040514': {
						name: '58040514 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาสถิติประยุกต์ (AS)'
					},
					'63045014': {
						name: '63045014 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาสถิติประยุกต์ (AS)'
					},
					'4092': {
						name: '4092 หลักสูตรวิทยาศาสตรบัณฑิต (ต่อเนื่อง 2 ปี) สาขาวิชาสถิติประยุกต์ (ASs)'
					},
					'484092': {
						name: '484092 หลักสูตรวิทยาศาสตรบัณฑิต (ต่อเนื่อง) สาขาสถิติประยุกต์ (ASs)'
					},
					'534092': {
						name: '534092 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาสถิติประยุกต์ (ต่อเนื่อง) (ASs)'
					},
					'464104': {
						name: '464104 หลักสุตรวิทยาศาสตรบัณฑิต สาขาวิชาสถิติธุรกิจและการประกันภัย (ASB)'
					},
					'534104': {
						name: '534104 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาสถิติธุรกิจและการประกันภัย (ASB)'
					},
					'58040534': {
						name: '58040534 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาสถิติธุรกิจและการประกันภัย (ASB)'
					},
					'63045034': {
						name: '63045034 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาสถิติธุรกิจและการประกันภัย (ASB)'
					},
					'61045044': {
						name: '61045044 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์ข้อมูลและการวิเคราะห์เชิงสถิติ (SDA)'
					},
					'66045044': {
						name: '66045044 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์ข้อมูลและการวิเคราะห์เชิงสถิติ (SDA)'
					},
					'61045052': {
						name: '61045052 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์ข้อมูลและการวิเคราะห์เชิงสถิติ (SDAs)'
					},
					'66045052': {
						name: '66045052 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์ข้อมูลและการวิเคราะห์เชิงสถิติ (SDAs)'
					},
					'66045064': {
						name: '66045064 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาสถิติประยุกต์สำหรับวิทยาการวิเคราะห์ธุรกิจและอุตสาหกรรม (ASI)'
					},
					'425202': {
						name: '425202 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาสถิติประยุกต์ (MAST)'
					},
					'55040542': {
						name: '55040542 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาสถิติประยุกต์ (MAST)'
					},
					'58040542': {
						name: '58040542 วิทยาศาสตรมหาบัณฑิต (MAST)'
					},
					'63045212': {
						name: '63045212 วิทยาศาสตรมหาบัณฑิต สาขาวิชาสถิติประยุกต์ (MAST)'
					},
					'55040553': {
						name: '55040553 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาสถิติประยุกต์ (DAST)'
					},
					'60040553': {
						name: '60040553 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาสถิติประยุกต์ (DAST)'
					},
					'65045513': {
						name: '65045513 ปรัชญาดุษฎีบัณฑิต สาขาวิชาสถิติประยุกต์ (DAST)'
					},
					'65045523': {
						name: '65045523 ปรัชญาดุษฎีบัณฑิต สาขาวิชาสถิติประยุกต์ (หลักสูตรภาษาอังกฤษ) (EDAST)'
					}
				}
			},
			'0406': {
				name: 'วิทยาการคอมพิวเตอร์และสารสนเทศ',
				curriculums: {
					'414054': {
						name: '414054 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์ประยุกต์ (CS)'
					},
					'484054': {
						name: '484054 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์ประยุกต์ (CS)'
					},
					'534054': {
						name: '534054 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์ประยุกต์ (CS)'
					},
					'374082': {
						name: '374082 หลักสูตรวิทยาศาสตรบัณฑิต (ต่อเนื่อง) สาขาวิชาวิทยาการคอมพิวเตอร์ (CSs)'
					},
					'444082': {
						name: '444082 หลักสูตรวิทยาศาสตรบัณฑิต (ต่อเนื่อง) สาขาวิชาวิทยาการคอมพิวเตอร์ (CSs)'
					},
					'494082': {
						name: '494082 หลักสูตรวิทยาศาสตรบัณฑิต (ต่อเนื่อง)  สาขาวิชาวิทยาการคอมพิวเตอร์ (CSs)'
					},
					'54040644': {
						name: '54040644 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์ (CS)'
					},
					'59040644': {
						name: '59040644 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์ (CS)'
					},
					'64046034': {
						name: '64046034 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์ (CS)'
					},
					'465472': {
						name: '465472 วิทยาศาสตรมหาบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์ (ภาคพิเศษ) (MCS)'
					},
					'57040632': {
						name: '57040632 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาวิทยาการคอมพิวเตอร์ (MCS)'
					},
					'62046212': {
						name: '62046212 หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์ (MCS)'
					},
					'59040662': {
						name: '59040662 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาวิศวกรรมซอฟต์แวร์ (MSE)'
					},
					'55040653': {
						name: '55040653 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาวิทยาการคอมพิวเตอร์ (DCS)'
					},
					'59040653': {
						name: '59040653 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาวิทยาการคอมพิวเตอร์ (DCS)'
					},
					'64046513': {
						name: '64046513 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์ (DCS)'
					}
				}
			},
			'0407': {
				name: 'เทคโนโลยีชีวภาพ',
				curriculums: {
					'474114': {
						name: '474114 วิทยาศาสตรบัณฑิต  สาขาวิชาเทคโนโลยีชีวภาพ (BT)'
					},
					'534114': {
						name: '534114 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาเทคโนโลยีชีวภาพ (BT)'
					},
					'58040714': {
						name: '58040714 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาเทคโนโลยีชีวภาพ (BT)'
					},
					'63047014': {
						name: '63047014 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาเทคโนโลยีชีวภาพ (BT)'
					},
					'59040722': {
						name: '59040722 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาเทคโนโลยีชีวภาพ (MBT)'
					},
					'65047212': {
						name: '65047212 หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาเทคโนโลยีชีวภาพ (MBT)'
					}
				}
			}
		}
	},
	'05': {
		name: 'คณะอุตสาหกรรมเกษตร',
		departments: {
			'0501': {
				name: 'เทคโนโลยีอุตสาหกรรมเกษตรและการจัดการ',
				curriculums: {
					'469014': {
						name: '469014 วิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีอุตสาหกรรมเกษตรและการจัดการ (ATM)'
					},
					'489014': {
						name: '489014 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีอุตสาหกรรมเกษตรและการจัดการ (ATM)'
					},
					'539014': {
						name: '539014 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีอุตสาหกรรมเกษตรและการจัดการ (ATM)'
					},
					'56050124': {
						name: '56050124 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาวิทยาศาสตร์การอาหารและโภชนาการ (FSN)'
					},
					'61051024': {
						name: '61051024 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาวิทยาศาสตร์การอาหารและโภชนาการ (FSN)'
					},
					'66051023': {
						name: '66051023 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาวิทยาศาสตร์การอาหารและโภชนาการ (FSN)'
					},
					'66051024': {
						name: '66051024 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาวิทยาศาสตร์การอาหารและโภชนาการ (FSN)'
					},
					'58050134': {
						name: '58050134 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์การอาหารและการจัดการ (FSM)'
					},
					'63051034': {
						name: '63051034 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์การอาหารและการจัดการ (FSM)'
					},
					'61051212': {
						name: '61051212 หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาวิทยาศาสตร์การอาหารและการจัดการ (MFSM)'
					}
				}
			},
			'0502': {
				name: 'พัฒนาผลิตภัณฑ์อุตสาหกรรมเกษตร',
				curriculums: {
					'479024': {
						name: '479024 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาพัฒนาผลิตภัณฑ์อุตสาหกรรมเกษตร (APD)'
					},
					'489024': {
						name: '489024 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาพัฒนาผลิตภัณฑ์อุตสาหกรรมเกษตร (APD)'
					},
					'539024': {
						name: '539024 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชาพัฒนาผลิตภัณฑ์อุตสาหกรรมเกษตร (APD)'
					}
				}
			},
			'0503': {
				name: 'นวัตกรรมและเทคโนโลยีการพัฒนาผลิตภัณฑ์',
				curriculums: {
					'58050314': {
						name: '58050314 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชานวัตกรรมและเทคโนโลยีการพัฒนาผลิตภัณฑ์ (IPD)'
					},
					'62053014': {
						name: '62053014 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชานวัตกรรมและเทคโนโลยีการพัฒนาผลิตภัณฑ์ (IPD)'
					},
					'64053014': {
						name: '64053014 หลักสูตรวิทยาศาสตรบัณฑิต  สาขาวิชานวัตกรรมและเทคโนโลยีการพัฒนาผลิตภัณฑ์ (IPD)'
					}
				}
			}
		}
	},
	'06': {
		name: 'คณะเทคโนโลยีและการจัดการอุตสาหกรรม',
		departments: {
			'0601': {
				name: 'การจัดการอุตสาหกรรม',
				curriculums: {
					'426044': {
						name: '426044 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาการจัดการอุตสาหกรรม (IM)'
					},
					'486044': {
						name: '486044 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาการจัดการอุตสาหกรรม (IM)'
					},
					'536044': {
						name: '536044 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาการจัดการอุตสาหกรรม (IM)'
					},
					'56060114': {
						name: '56060114 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาการจัดการอุตสาหกรรม (IM)'
					},
					'59060114': {
						name: '59060114 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาการจัดการอุตสาหกรรม (IM)'
					},
					'426012': {
						name: '426012 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาการจัดการอุตสาหกรรม (IMT)'
					},
					'486012': {
						name: '486012 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต (ต่อเนื่อง) สาขาวิชาการจัดการอุตสาหกรรม (IMT)'
					},
					'536012': {
						name: '536012 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาการจัดการอุตสาหกรรม  (ต่อเนื่อง) (IMT)'
					},
					'56060122': {
						name: '56060122 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาการจัดการอุตสาหกรรม  (ต่อเนื่อง) (IMT)'
					},
					'59060122': {
						name: '59060122 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาการจัดการอุตสาหกรรม  (ต่อเนื่อง) (IMT)'
					},
					'64061022': {
						name: '64061022 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาการจัดการอุตสาหกรรม  (ต่อเนื่อง) (IMT)'
					},
					'64061034': {
						name: '64061034 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมอุตสาหการและการจัดการ (IEM)'
					},
					'485642': {
						name: '485642 หลักสูตรอุตสาหกรรมศาสตรมหาบัณฑิต สาขาวิชาการจัดการอุตสาหกรรม (MIM)'
					},
					'58060132': {
						name: '58060132 หลักสูตรอุตสาหกรรมศาสตรมหาบัณฑิต สาขาวิชาการจัดการอุตสาหกรรม (MIM)'
					},
					'64061212': {
						name: '64061212 หลักสูตรอุตสาหกรรมศาสตรมหาบัณฑิต สาขาวิชาการจัดการอุตสาหกรรม (MIM)'
					}
				}
			},
			'0602': {
				name: 'เทคโนโลยีสารสนเทศ',
				curriculums: {
					'426054': {
						name: '426054 หลักสูตรเทคโนโลยีบัณฑิต สาขาวิชาเทคโนโลยีสารสนเทศ (IT)'
					},
					'486054': {
						name: '486054 หลักสูตรเทคโนโลยีบัณฑิต สาขาวิชาเทคโนโลยีสารสนเทศ (IT)'
					},
					'546054': {
						name: '546054 หลักสูตรเทคโนโลยีบัณฑิต สาขาวิชาเทคโนโลยีสารสนเทศ (IT)'
					},
					'56060214': {
						name: '56060214 หลักสูตรเทคโนโลยีบัณฑิต สาขาวิชาเทคโนโลยีสารสนเทศ (IT)'
					},
					'60060214': {
						name: '60060214 หลักสูตรเทคโนโลยีบัณฑิต สาขาวิชาเทคโนโลยีสารสนเทศ (IT)'
					},
					'62062014': {
						name: '62062014 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีสารสนเทศ (IT)'
					},
					'426022': {
						name: '426022 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต (ต่อเนื่อง 2 ปี) สาขาวิชาเทคโนโลยีสารสนเทศเพื่ออุตสาหกรรม (ITI)'
					},
					'486022': {
						name: '486022 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต (ต่อเนื่อง) สาขาวิชาเทคโนโลยีสารสนเทศ (ITI)'
					},
					'546022': {
						name: '546022 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต (ต่อเนื่อง) สาขาวิชาเทคโนโลยีสารสนเทศ (ITI)'
					},
					'56060222': {
						name: '56060222 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีสารสนเทศ (ต่อเนื่อง) (ITI)'
					},
					'61062022': {
						name: '61062022 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีสารสนเทศ (ต่อเนื่อง) (ITI)'
					},
					'66062022': {
						name: '66062022 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีสารสนเทศ (ต่อเนื่อง) (ITI)'
					},
					'62062034': {
						name: '62062034 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมสารสนเทศและเครือข่าย (INE)'
					},
					'62062043': {
						name: '62062043 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมสารสนเทศและเครือข่าย (INET)'
					},
					'62062053': {
						name: '62062053 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีสารสนเทศ (ITT)'
					},
					'55060232': {
						name: '55060232 หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาวิทยาการสารสนเทศประยุกต์ (MITM)'
					}
				}
			},
			'0603': {
				name: 'การออกแบบและบริหารงานก่อสร้าง',
				curriculums: {
					'426032': {
						name: '426032 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต (ต่อเนื่อง 2 ปี) สาขาวิชาการบริหารงานก่อสร้าง (CCM)'
					},
					'476032': {
						name: '476032 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต (ต่อเนื่อง) สาขาวิชาการบริหารงานก่อสร้าง (CCM)'
					},
					'476084': {
						name: '476084 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาการบริหารงานก่อสร้าง (CM)'
					},
					'526114': {
						name: '526114 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาคอมพิวเตอร์ช่วยออกแบบและบริหารงานก่อสร้าง (CA)'
					},
					'55060334': {
						name: '55060334 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาคอมพิวเตอร์ช่วยออกแบบและบริหารงานก่อสร้าง (CA)'
					},
					'60060334': {
						name: '60060334 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาคอมพิวเตอร์ช่วยออกแบบและบริหารงานก่อสร้าง (CA)'
					},
					'65063034': {
						name: '65063034 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาคอมพิวเตอร์ช่วยออกแบบและบริหารงานก่อสร้าง (CA)'
					},
					'60060343': {
						name: '60060343 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาคอมพิวเตอร์ช่วยออกแบบและบริหารงานก่อสร้าง (CDM)'
					},
					'65063043': {
						name: '65063043 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาคอมพิวเตอร์ช่วยออกแบบและบริหารงานก่อสร้าง (CDM)'
					}
				}
			},
			'0604': {
				name: 'วิศวกรรมเกษตรเพื่ออุตสาหกรรม',
				curriculums: {
					'446064': {
						name: '446064 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องจักรกลเกษตร (TA)'
					},
					'536064': {
						name: '536064 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องจักรกลเกษตร (TA)'
					},
					'56060414': {
						name: '56060414 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องจักรกลเกษตร (TA)'
					},
					'59060414': {
						name: '59060414 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องจักรกลเกษตร (TA)'
					},
					'476092': {
						name: '476092 อุตสาหกรรมศาสตรบัณฑิต (ต่อเนื่อง) สาขาวิชาเทคโนโลยีเครื่องจักรกลเกษตร (TAM)'
					},
					'536092': {
						name: '536092 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องจักรกลเกษตร (ต่อเนื่อง) (TAM)'
					},
					'56060422': {
						name: '56060422 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องจักรกลเกษตร (ต่อเนื่อง) (TAM)'
					},
					'59060422': {
						name: '59060422 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องจักรกลเกษตร (ต่อเนื่อง) (TAM)'
					},
					'61064032': {
						name: '61064032 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องจักรกลเกษตร (TAT)'
					},
					'62064044': {
						name: '62064044 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องกลและกระบวนการผลิต (MM)'
					},
					'62064053': {
						name: '62064053 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องกลและกระบวนการผลิต (MMT)'
					},
					'62064062': {
						name: '62064062 หลักสูตรอุตสาหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเครื่องกลและกระบวนการผลิต (MMW)'
					},
					'64064074': {
						name: '64064074 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเกษตรและอาหาร (AFE)'
					},
					'64064083': {
						name: '64064083 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเกษตรและอาหาร (AFET)'
					},
					'65064212': {
						name: '65064212 หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมการจัดการ (MEM)'
					}
				}
			},
			'0605': {
				name: 'การจัดการอุตสาหกรรมการท่องเที่ยว',
				curriculums: {
					'466074': {
						name: '466074 หลักสูตรบริหารธุรกิจบัณฑิตสาขาวิชาการจัดการอุตสาหกรรมการท่องเที่ยวและการโรงแรม (TH)'
					}
				}
			},
			'0606': {
				name: 'X',
				curriculums: {}
			},
			'0607': {
				name: 'X',
				curriculums: {}
			}
		}
	},
	'07': {
		name: 'คณะเทคโนโลยีสารสนเทศและนวัตกรรมดิจิทัล',
		departments: {
			'0701': {
				name: 'เทคโนโลยีสารสนเทศ',
				curriculums: {
					'62071014': {
						name: '62071014 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการสารสนเทศเพื่อเศรษฐกิจดิจิทัล (หลักสูตรนานาชาติ) (I-BIT)'
					},
					'425162': {
						name: '425162 วิทยาศาสตรมหาบัณฑิต สาขาวิชาเทคโนโลยีสารสนเทศ (ภาคภาษาอังกฤษ), วท.ม. (เทคโนโลยีสารสนเทศ) (IMIT)'
					},
					'525162': {
						name: '525162 วิทยาศาสตรมหาบัณฑิต (เทคโนโลยีสารสนเทศ) (นานาชาติ) (IMIT)'
					},
					'55070122': {
						name: '55070122 วิทยาศาสตรมหาบัณฑิต  สาขาวิชาเทคโนโลยีสารสนเทศ (นานาชาติ) (IMIT)'
					},
					'425182': {
						name: '425182 วิทยาศาสตร์มหาบัณฑิต สาขาวิชาเทคโนโลยีสารสนเทศ, วท.ม. (เทคโนโลยีสารสนเทศ) (SMITT)'
					},
					'55070112': {
						name: '55070112 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาเทคโนโลยีสารสนเทศ (MITT)'
					},
					'60070112': {
						name: '60070112 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาเทคโนโลยีสารสนเทศ (MITT)'
					},
					'60070152': {
						name: '60070152 วิทยาศาสตรมหาบัณฑิต (สารสนเทศและวิทยาศาสตร์ข้อมูล) (IMIT)'
					},
					'65071252': {
						name: '65071252 หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาสารสนเทศและวิทยาศาสตร์ข้อมูล (หลักสูตรนานาชาติ) (IMIT)'
					},
					'65071262': {
						name: '65071262 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาวิทยาศาสตร์ข้อมูลเพื่อนวัตกรรม (MITT)'
					},
					'465513': {
						name: '465513 ปรัชญาดุษฎีบัณฑิต สาขาวิชาเทคโนโลยีสารสนเทศ(หลักสูตรนานาชาติ) (IDIT)'
					},
					'55070143': {
						name: '55070143 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาเทคโนโลยีสารสนเทศ (นานาชาติ) (IDIT)'
					},
					'55070133': {
						name: '55070133 ปรัชญาดุษฎีบัณฑิต  สาขาวิชาเทคโนโลยีสารสนเทศ (DITT)'
					},
					'60070133': {
						name: '60070133 ปรัชญาดุษฎีบัณฑิต (เทคโนโลยีสารสนเทศ) (DITT)'
					},
					'60070163': {
						name: '60070163 ปรัชญาดุษฎีบัณฑิต (สารสนเทศและวิทยาศาสตร์ข้อมูล) (IDIT)'
					},
					'65071553': {
						name: '65071553 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาสารสนเทศและวิทยาศาสตร์ข้อมูล (หลักสูตรนานาชาติ) (IDIT)'
					},
					'65071563': {
						name: '65071563 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาวิทยาศาสตร์ข้อมูลเพื่อนวัตกรรม (DITT)'
					}
				}
			},
			'0702': {
				name: 'การจัดการเทคโนโลยีสารสนเทศ',
				curriculums: {
					'545632': {
						name: '545632 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาระบบสารสนเทศเพื่อการจัดการ (MMIST)'
					},
					'57070222': {
						name: '57070222 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาระบบสารสนเทศเพื่อการจัดการ (MMIST)'
					},
					'58070222': {
						name: '58070222 วิทยาศาสตรมหาบัณฑิต (ระบบสารสนเทศเพื่อการจัดการ) (MMIST)'
					},
					'62072232': {
						name: '62072232 หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาระบบสารสนเทศเพื่อการจัดการ (MMIST)'
					},
					'61072513': {
						name: '61072513 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาระบบสารสนเทศเพื่อการจัดการ (SDMIS)'
					}
				}
			},
			'0703': {
				name: 'การบริหารเครือข่ายดิจิทัลและความมั่นคงปลอดภัยสารสนเทศ',
				curriculums: {
					'57070312': {
						name: '57070312 วิทยาศาสตรมหาบัณฑิต (การสื่อสารข้อมูลและเครือข่าย) (SMDN)'
					},
					'62073232': {
						name: '62073232 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาการบริหารเครือข่ายและความมั่นคงปลอดภัยสารสนเทศ (MDNS)'
					},
					'64073513': {
						name: '64073513 หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาการบริหารเครือข่ายและความมั่นคงปลอดภัยสารสนเทศ (DDNS)'
					}
				}
			}
		}
	},
	'08': {
		name: 'คณะศิลปศาสตร์ประยุกต์',
		departments: {
			'0801': {
				name: 'ภาษา',
				curriculums: {
					'405132': {
						name: '405132 ศิลปศาสตร์มหาบัณฑิต สาขาวิชาภาษาอังกฤษเพื่อธุรกิจและอุตสาหกรรม (EBI)'
					},
					'535592': {
						name: '535592 ศิลปศาสตรมหาบัณฑิต (MTEB)'
					},
					'58080112': {
						name: '58080112 หลักสูตรศิลปศาสตรมหาบัณฑิต  สาขาวิชาการแปลเพื่อการศึกษาและธุรกิจ (MTEB)'
					},
					'54080122': {
						name: '54080122 ศิลปศาสตรมหาบัณฑิต  สาขาวิชาภาษาอังกฤษเพื่อการสื่อสารเชิงธุรกิจและอุตสาหกรรม (MBIC)'
					},
					'59080122': {
						name: '59080122 ศิลปศาสตรมหาบัณฑิต สาขาวิชาภาษาอังกฤษเพื่อการสื่อสารเชิงธุรกิจและอุตสาหกรรม (หลักสูตรภาษาอังกฤษ) (MBIC)'
					},
					'64081262': {
						name: '64081262 ศิลปศาสตรมหาบัณฑิต สาขาวิชาภาษาอังกฤษเพื่อการสื่อสารเชิงธุรกิจและอุตสาหกรรม (หลักสูตรภาษาอังกฤษ) (MBIC)'
					}
				}
			},
			'0802': {
				name: 'สังคมศาสตร์',
				curriculums: {
					'465372': {
						name: '465372 บริหารธุรกิจมหาบัณฑิต การพัฒนาทรัพยากรมนุษย์เพื่อธุรกิจอุตสาหกรรม (XMHR)'
					}
				}
			},
			'0803': {
				name: 'มนุษยศาสตร์',
				curriculums: {
					'475412': {
						name: '475412 ชื่อหลักสูตรภาษาไทย (MIOP)'
					},
					'55080312': {
						name: '55080312 ศิลปศาสตรมหาบัณฑิต จิตวิทยาอุตสาหกรรมและองค์การ (MIOP)'
					},
					'59080312': {
						name: '59080312 หลักสูตรศิลปศาสตรมหาบัณฑิต  สาขาวิชาจิตวิทยาอุตสาหกรมและองค์การ (MIOP)'
					},
					'64083212': {
						name: '64083212 หลักสูตรศิลปศาสตรมหาบัณฑิต  สาขาวิชาจิตวิทยาอุตสาหกรรมและองค์การ (MIOP)'
					},
					'55080323': {
						name: '55080323 ปรัชญาดุษฎีบัณฑิต จิตวิทยาอุตสาหกรรมและองค์การ (DIOP)'
					},
					'58080323': {
						name: '58080323 ปรัชญาดุษฎีบัณฑิต จิตวิทยาอุตสาหกรรมและองค์การ (DIOP)'
					},
					'63083513': {
						name: '63083513 หลักสูตรปรัชญาดุษฎีบัณฑิต  สาขาวิชาจิตวิทยาอุตสาหกรรมและองค์การ (DIOP)'
					}
				}
			}
		}
	},
	'09': {
		name: 'บัณฑิตวิทยาลัยวิศวกรรมศาสตร์นานาชาติฯ',
		departments: {
			'0901': {
				name: 'วิศวกรรมเครื่องกลการจำลองและการออกแบบ',
				curriculums: {
					'61179999': {
						name: '61179999 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการจัดการท่องเที่ยวและโรงแรม (IMESD)'
					}
				}
			},
			'0902': {
				name: 'วิศวกรรมไฟฟ้ากำลังและพลังงาน (นานาชาติ)',
				curriculums: {}
			},
			'0903': {
				name: 'วิศวกรรมการผลิต (นานาชาติ)',
				curriculums: {}
			},
			'0904': {
				name: 'วิศวกรรมโทรคมนาคม (นานาชาติ)',
				curriculums: {}
			},
			'0905': {
				name: 'วิศวกรรมยานยนต์ (นานาชาติ)',
				curriculums: {}
			},
			'0906': {
				name: 'วิศวกรรมเคมีและกระบวนการ (นานาชาติ)',
				curriculums: {}
			},
			'0907': {
				name: 'วิศวกรรมระบบซอฟต์แวร์ (นานาชาติ)',
				curriculums: {}
			},
			'0908': {
				name: 'วิศวกรรมวัสดุและโลหะการ (นานาชาติ)',
				curriculums: {}
			},
			'0909': {
				name: 'วิศวกรรมเครื่องกลและกระบวนการ',
				curriculums: {}
			},
			'0910': {
				name: 'วิศวกรรมไฟฟ้าและระบบซอฟต์แวร์',
				curriculums: {
					'58999999': {
						name: '58999999 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาฟิสิกส์อุตสาหกรรมและอุปกรณ์การแพทย์ (IDEEE)'
					}
				}
			}
		}
	},
	'10': {
		name: 'บัณฑิตวิทยาลัย',
		departments: {}
	},
	'11': {
		name: 'คณะสถาปัตยกรรมและการออกแบบ',
		departments: {
			'1100': {
				name: 'ช่างทองหลวง',
				curriculums: {}
			},
			'1101': {
				name: 'เทคโนโลยีศิลปอุตสาหกรรม',
				curriculums: {
					'443374': {
						name: '443374 หลักสูตรศิลปบัณฑิต สาขาวิชาออกแบบภายใน (Int.D)'
					},
					'523374': {
						name: '523374 หลักสูตรศิลปบัณฑิต สาขาวิชาออกแบบภายใน (Int.D)'
					},
					'473464': {
						name: '473464 หลักสูตรศิลปบัณฑิต สาขาวิชาออกแบบเซรามิกส์ (Cer.D)'
					},
					'523464': {
						name: '523464 หลักสูตรศิลปบัณฑิต สาขาวิชาออกแบบเซรามิกส์ (Cer.D)'
					},
					'55110124': {
						name: '55110124 หลักสูตรศิลปบัณฑิต สาขาวิชาออกแบบเซรามิกส์ (Cer.D)'
					},
					'54110134': {
						name: '54110134 หลักสูตรศิลปบัณฑิต สาขาวิชาศิลปประยุกต์และการออกแบบผลิตภัณฑ์ (AAP.D)'
					},
					'55110134': {
						name: '55110134 หลักสูตรศิลปบัณฑิต สาขาวิชาศิลปประยุกต์และการออกแบบผลิตภัณฑ์ (AAP.D)'
					},
					'60110134': {
						name: '60110134 หลักสูตรศิลปบัณฑิต สาขาวิชาศิลปประยุกต์และการออกแบบผลิตภัณฑ์ (AAP.D)'
					},
					'65111034': {
						name: '65111034 หลักสูตรศิลปบัณฑิต สาขาวิชาศิลปประยุกต์และการออกแบบผลิตภัณฑ์ (AAP.D)'
					},
					'60110124': {
						name: '60110124 หลักสูตรศิลปบัณฑิต สาขาวิชาออกแบบผลิตภัณฑ์นวัตกรรมเซรามิกส์ (CI.D)'
					},
					'65111054': {
						name: '65111054 หลักสูตรศิลปบัณฑิต สาขาวิชาออกแบบผลิตภัณฑ์นวัตกรรมเซรามิกส์ (CI.D)'
					}
				}
			},
			'1102': {
				name: 'สถาปัตยกรรม',
				curriculums: {
					'55110114': {
						name: '55110114 หลักสูตรศิลปบัณฑิต สาขาวิชาออกแบบภายใน (Int.D)'
					},
					'60110114': {
						name: '60110114 หลักสูตรศิลปบัณฑิต สาขาวิชาออกแบบภายใน (Int.D)'
					},
					'65111014': {
						name: '65111014 หลักสูตรศิลปบัณฑิต สาขาวิชาออกแบบภายใน (Int.D)'
					},
					'54110215': {
						name: '54110215 หลักสูตรสถาปัตยกรรมศาสตรบัณฑิต สาขาวิชาสถาปัตยกรรม (Arch)'
					},
					'60110215': {
						name: '60110215 หลักสูตรสถาปัตยกรรมศาสตรบัณฑิต สาขาวิชาสถาปัตยกรรม (Arch)'
					},
					'66112015': {
						name: '66112015 หลักสูตรสถาปัตยกรรมศาสตรบัณฑิต สาขาวิชาสถาปัตยกรรม (Arch)'
					},
					'61112212': {
						name: '61112212 หลักสูตรสถาปัตยกรรมศาสตรมหาบัณฑิต สาขาวิชานวัตกรรมและการออกแบบเพื่อความยั่งยืน (MAPIDS)'
					}
				}
			},
			'1103': {
				name: 'การจัดการงานออกแบบและพัฒนาธุรกิจ',
				curriculums: {
					'55110314': {
						name: '55110314 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการออกแบบสำนักงานอัตโนมัติและการจัดการธุรกิจ (OA.B)'
					},
					'60110324': {
						name: '60110324 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการจัดการงานออกแบบภายในและพัฒนาธุรกิจ (IDM.B)'
					},
					'65113024': {
						name: '65113024 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการจัดการงานออกแบบภายในและพัฒนาธุรกิจ (IDM.B)'
					}
				}
			}
		}
	},
	'12': {
		name: 'คณะวิศวกรรมศาสตร์และเทคโนโลยี',
		departments: {
			'1201': {
				name: 'เทคโนโลยีวิศวกรรมกระบวนการเคมี',
				curriculums: {
					'57120114': {
						name: '57120114 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมกระบวนการเคมี (CPet)'
					},
					'62121014': {
						name: '62121014 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมกระบวนการเคมี (CPet)'
					}
				}
			},
			'1202': {
				name: 'เทคโนโลยีวิศวกรรมการวัดคุมและอัตโนมัติ',
				curriculums: {
					'57120214': {
						name: '57120214 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมการวัดคุมและอัตโนมัติ (IAet)'
					},
					'62122014': {
						name: '62122014 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมไฟฟ้าและอัตโนมัติ (IAet)'
					}
				}
			},
			'1203': {
				name: 'เทคโนโลยีวิศวกรรมวัสดุและกระบวนการผลิต',
				curriculums: {
					'57120314': {
						name: '57120314 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมวัสดุและกระบวนการผลิต (MPet)'
					},
					'62123014': {
						name: '62123014 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมวัสดุและกระบวนการผลิต (MPet)'
					}
				}
			},
			'1204': {
				name: 'เทคโนโลยีวิศวกรรมอุตสาหการและโลจิสติกส์',
				curriculums: {
					'57120413': {
						name: '57120413 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมอุตสาหการและโลจิสติกส์ (ILet)'
					},
					'57120414': {
						name: '57120414 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมอุตสาหการและโลจิสติกส์ (ILet)'
					},
					'62124014': {
						name: '62124014 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมอุตสาหการและโลจิสติกส์ (ILet)'
					}
				}
			},
			'1205': {
				name: 'เทคโนโลยีวิศวกรรมเครื่องกลและยานยนต์',
				curriculums: {
					'57120513': {
						name: '57120513 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมเครื่องกลและยานยนต์ (MAet)'
					},
					'57120514': {
						name: '57120514 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมเครื่องกลและยานยนต์ (MAet)'
					},
					'62125014': {
						name: '62125014 หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมเครื่องกลและยานยนต์ (MAet)'
					}
				}
			},
			'1206': {
				name: 'เทคโนโลยียานยนต์สมัยใหม่และระบบอัตโนมัติ',
				curriculums: {
					'63126012': {
						name: '63126012 หลักสูตรเทคโนโลยีบัณฑิต สาขาวิชาเทคโนโลยียานยนต์สมัยใหม่และระบบอัตโนมัติ (ต่อเนื่อง) (NAAT)'
					}
				}
			}
		}
	},
	'13': {
		name: 'คณะวิทยาศาสตร์ พลังงานและสิ่งแวดล้อม',
		departments: {
			'1301': {
				name: 'กระบวนการอุตสาหกรรมเคมีและสิ่งแวดล้อม',
				curriculums: {
					'57130114': {
						name: '57130114 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชากระบวนการอุตสาหกรรมเคมีและสิ่งแวดล้อม (ICPE)'
					},
					'62131014': {
						name: '62131014 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชากระบวนการอุตสาหกรรมเคมีและสิ่งแวดล้อม (CIPE)'
					},
					'57130122': {
						name: '57130122 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชากระบวนการอุตสาหกรรมเคมีและสิ่งแวดล้อม (SMICPE)'
					},
					'62131242': {
						name: '62131242 หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชากระบวนการอุตสาหกรรมเคมีและสิ่งแวดล้อม (MCIPE)'
					}
				}
			},
			'1302': {
				name: 'เทคโนโลยีพลังงานและการจัดการ',
				curriculums: {
					'57130214': {
						name: '57130214 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีพลังงานและการจัดการ (ETAM)'
					},
					'62132014': {
						name: '62132014 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีพลังงานและการจัดการ (ETAM)'
					},
					'57130222': {
						name: '57130222 หลักสูตรวิทยาศาสตรมหาบัณฑิต  สาขาวิชาเทคโนโลยีพลังงานและการจัดการ (SMETAM)'
					},
					'62132212': {
						name: '62132212 หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิชาเทคโนโลยีพลังงานและการจัดการ (METAM)'
					}
				}
			},
			'1303': {
				name: 'วิทยาการข้อมูลและการคำนวณเชิงธุรกิจและอุตสาหกรรม',
				curriculums: {
					'65133014': {
						name: '65133014 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการข้อมูลและการคำนวณเชิงธุรกิจและอุตสาหกรรม (DSC)'
					}
				}
			}
		}
	},
	'14': {
		name: 'คณะบริหารธุรกิจ',
		departments: {
			'1401': {
				name: 'บริหารธุรกิจอุตสาหกรรม',
				curriculums: {
					'57140114': {
						name: '57140114 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาบริหารธุรกิจอุตสาหกรรมและโลจิสติกส์ (BIBLA)'
					},
					'62141014': {
						name: '62141014 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาบริหารธุรกิจอุตสาหกรรมและโลจิสติกส์ (BIBLA)'
					},
					'60140122': {
						name: '60140122 บริหารธุรกิจมหาบัณฑิต (บริหารธุรกิจอุตสาหกรรม) (MBA)'
					},
					'65141212': {
						name: '65141212 หลักสูตรบริหารธุรกิจมหาบัณฑิต สาขาวิชาบริหารธุรกิจอุตสาหกรรม (MBA)'
					},
					'57020733': {
						name: '57020733 หลักสูตรบริหารธุรกิจดุษฎีบัณฑิต  สาขาวิชาบริหารธุรกิจอุตสาหกรรม (XDBA)'
					},
					'62141513': {
						name: '62141513 หลักสูตรบริหารธุรกิจดุษฎีบัณฑิต สาขาวิชาบริหารธุรกิจอุตสาหกรรม (XDBA)'
					}
				}
			},
			'1402': {
				name: 'บริหารธุรกิจอุตสาหกรรม',
				curriculums: {
					'55020722': {
						name: '55020722 หลักสูตรบริหารธุรกิจมหาบัณฑิต  สาขาวิชาบริหารธุรกิจอุตสาหกรรม (MBA)'
					},
					'57140214': {
						name: '57140214 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาคอมพิวเตอร์ธุรกิจ (Bcom)'
					},
					'62142014': {
						name: '62142014 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาคอมพิวเตอร์ธุรกิจ (Bcom)'
					}
				}
			},
			'1403': {
				name: 'บริหารธุรกิจอุตสาหกรรม',
				curriculums: {
					'57140314': {
						name: '57140314 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการบัญชี (BAcc)'
					},
					'62143014': {
						name: '62143014 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการบัญชี (BAcc)'
					},
					'63143212': {
						name: '63143212 หลักสูตรบริหารธุรกิจมหาบัณฑิต สาขาวิชาการบัญชี (X-MBAc)'
					}
				}
			}
		}
	},
	'15': {
		name: 'วิทยาลัยนานาชาติ',
		departments: {
			'1501': {
				name: 'บริหารธุรกิจ',
				curriculums: {
					'57150114': {
						name: '57150114 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการค้าระหว่างประเทศและธุรกิจโลจิสติกส์ (หลักสูตรนานาชาติ) (I-ITBL)'
					},
					'62151014': {
						name: '62151014 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการค้าระหว่างประเทศและธุรกิจโลจิสติกส์ (หลักสูตรนานาชาติ) (I-ITBL)'
					},
					'66151014': {
						name: '66151014 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการค้าระหว่างประเทศและธุรกิจโลจิสติกส์ (หลักสูตรนานาชาติ) (I-ITBL)'
					}
				}
			}
		}
	},
	'16': {
		name: 'คณะพัฒนาธุรกิจและอุตสาหกรรม',
		departments: {
			'1601': {
				name: 'การพัฒนาธุรกิจอุตสาหกรรมและทรัพยากรมนุษย์',
				curriculums: {
					'58160114': {
						name: '58160114 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการพัฒนาธุรกิจอุตสาหกรรมและทรัพยากรมนุษย์ (BBR)'
					},
					'63161014': {
						name: '63161014 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการพัฒนาธุรกิจอุตสาหกรรมและทรัพยากรมนุษย์ (BBR)'
					},
					'63161023': {
						name: '63161023 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการพัฒนาธุรกิจอุตสาหกรรมและทรัพยากรมนุษย์ (BBRs)'
					},
					'63161032': {
						name: '63161032 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการพัฒนาธุรกิจอุตสาหกรรมและทรัพยากรมนุษย์ (BBRx)'
					},
					'56080212': {
						name: '56080212 หลักสูตรบริหารธุรกิจมหาบัณฑิต  สาขาวิชาการพัฒนาธุรกิจอุตสาหกรรมและทรัพยากรมนุษย์ (SMBR)'
					},
					'61161212': {
						name: '61161212 หลักสูตรบริหารธุรกิจมหาบัณฑิต สาขาวิชาการพัฒนาธุรกิจอุตสาหกรรมและทรัพยากรมนุษย์ (SMBR)'
					},
					'64161212': {
						name: '64161212 หลักสูตรบริหารธุรกิจมหาบัณฑิต สาขาวิชาการพัฒนาธุรกิจอุตสาหกรรมและทรัพยากรมนุษย์ (XMBR)'
					},
					'57080223': {
						name: '57080223 หลักสูตรบริหารธุรกิจดุษฎีบัณฑิต  สาขาวิชาการพัฒนาธุรกิจอุตสาหกรรมและทรัพยากรมนุษย์ (XDBR)'
					},
					'61161513': {
						name: '61161513 หลักสูตรบริหารธุรกิจดุษฎีบัณฑิต สาขาวิชาการพัฒนาธุรกิจอุตสาหกรรมและทรัพยากรมนุษย์ (XDBR)'
					},
					'64161513': {
						name: '64161513 หลักสูตรบริหารธุรกิจดุษฎีบัณฑิต สาขาวิชาการพัฒนาธุรกิจอุตสาหกรรมและทรัพยากรมนุษย์ (XDBR)'
					}
				}
			},
			'1602': {
				name: 'การบริหารอุตสาหกรรมการผลิตและบริการ',
				curriculums: {
					'58160214': {
						name: '58160214 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการบริหารอุตสาหกรรมการผลิตและบริการ (BMS)'
					},
					'60160214': {
						name: '60160214 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการบริหารอุตสาหกรรมการผลิตและบริการ (BMS)'
					},
					'65162014': {
						name: '65162014 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการบริหารอุตสาหกรรมการผลิตและบริการ (BMS)'
					},
					'60160233': {
						name: '60160233 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการบริหารอุตสาหกรรมการผลิตและบริการ (BMSs)'
					},
					'65162023': {
						name: '65162023 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการบริหารอุตสาหกรรมการผลิตและบริการ (BMSs)'
					},
					'60160243': {
						name: '60160243 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการบริหารอุตสาหกรรมการผลิตและบริการ (BMSx)'
					},
					'65162032': {
						name: '65162032 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการบริหารอุตสาหกรรมการผลิตและบริการ (BMSx)'
					},
					'60160222': {
						name: '60160222 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการบริหารอุตสาหกรรมการผลิตและบริการ (BMSm)'
					},
					'65162042': {
						name: '65162042 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการบริหารอุตสาหกรรมการผลิตและบริการ (BMSm)'
					}
				}
			}
		}
	},
	'17': {
		name: 'คณะบริหารธุรกิจและอุตสาหกรรมบริการ',
		departments: {
			'1701': {
				name: 'บริหารธุรกิจท่องเที่ยวและโรงแรม',
				curriculums: {
					'536074': {
						name: '536074 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการจัดการอุตสาหกรรมการท่องเที่ยวและการโรงแรม (TH)'
					},
					'56060514': {
						name: '56060514 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการจัดการอุตสาหกรรมการท่องเที่ยวและการโรงแรม (TH)'
					},
					'61171014': {
						name: '61171014 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการจัดการท่องเที่ยวและโรงแรม (TH)'
					},
					'66171044': {
						name: '66171044 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการจัดการอุตสาหกรรมท่องเที่ยวและโรงแรม (TH)'
					},
					'61171033': {
						name: '61171033 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการจัดการท่องเที่ยวและโรงแรม (THT)'
					},
					'66171053': {
						name: '66171053 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาการจัดการอุตสาหกรรมท่องเที่ยวและโรงแรม (THT)'
					}
				}
			},
			'1702': {
				name: 'บริหารธุรกิจอุตสาหกรรมและการค้า',
				curriculums: {
					'59170214': {
						name: '59170214 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาบริหารธุรกิจอุตสาหกรรมและการค้า (IBT)'
					},
					'64172014': {
						name: '64172014 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาบริหารธุรกิจอุตสาหกรรมและการค้า (IBT)'
					},
					'59170223': {
						name: '59170223 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาบริหารธุรกิจอุตสาหกรรมและการค้า (IBTT)'
					},
					'64172023': {
						name: '64172023 หลักสูตรบริหารธุรกิจบัณฑิต สาขาวิชาบริหารธุรกิจอุตสาหกรรมและการค้า (IBTT)'
					},
					'60170232': {
						name: '60170232 หลักสูตรบริหารธุรกิจมหาบัณฑิต สาขาวิชาบริหารธุรกิจอุตสาหกรรมและการค้า (MIBT)'
					},
					'65172212': {
						name: '65172212 หลักสูตรบริหารธุรกิจมหาบัณฑิต สาขาวิชาบริหารธุรกิจอุตสาหกรรมและการค้า (MIBT)'
					}
				}
			}
		}
	},
	'18': {
		name: 'อุทยานเทคโนโลยี',
		departments: {
			'1801': {
				name: 'เทคโนโลยียานยนต์สมัยใหม่และระบบอัตโนมัติ',
				curriculums: {
					'66181012': {
						name: '66181012 หลักสูตรเทคโนโลยีบัณฑิต สาขาวิชาเทคโนโลยียานยนต์สมัยใหม่และระบบอัตโนมัติ (ต่อเนื่อง) (NAAT)'
					}
				}
			}
		}
	}
};

interface CourseListData {
	[key: string]: {
		name: string;
		departments: {
			[key: string]: {
				name: string;
				curriculums: {
					[key: string]: {
						name: string;
					};
				};
			};
		};
	};
}
